{"title":"Here are 8 things investors will be looking for in Tesla's earnings report","date":"2021-07-25","classification":"good","text":"Title: Here are 8 things investors will be looking for in Tesla's earnings report\n(CNN)Tesla is the most secretive automaker on the planet, so investors are always eager to pore through its quarterly report and conference call, when they finally can get more than tweet-sized morsels of information.\nThe last two quarterly results have disappointed them. Shares have fallen nearly 30% from their record high set just ahead of its fourth-quarter report in late January, with more than a third of that slide in share price taking place since the company reported first quarter results in April.\nSo whether the best performing stock of 2020 can get back on track will depend greatly on what investors hear Monday evening, when Tesla releases its second quarter results.\nHere are the top issues they'll be looking at:\nHow are things going in China?\nUnlike other automakers, Tesla normally reports only global numbers, and doesn't break down sales by country or market. But if it wants to assure investors, it may need to give details on its sales in China, which is not only the largest market for all auto sales but also the major market with the greatest share of sales going to EVs.\nTesla was hit by widespread reports of safety problems in China, including the recall of almost all cars made at its Shanghai factory and a protest by Tesla owners at the Shanghai auto show in April.\n\"The China growth stories is the top of the list for Tesla,\" said Dan Ives, tech analyst with Wedbush Securities and a Tesla bull. \"This is their key market, we believe 40% of their sales will come from there next year. I think that's the linchpin to the stock going up or down.\"\nAlthough Chinese sales of EVs from other automakers are reportedly growing, Tesla's China sales fell 9.2%, according to stats cited by Gordon Johnson of GLJ Research, an analyst who is one of Tesla's harshest critics.\n\"It seems clear Tesla has a China demand problem,\" he wrote in a recent note. \"Weak second quarter 2021 China domestic sales likely translate into weak second quarter earnings for Tesla.\"\nHow did it make its profits?\nAnalysts surveyed by Refinitiv expect Tesla to report adjusted income of more than $1 billion for the second straight quarter, and net income of about $650 million. Both would be records for the company, and would mark the eighth straight quarterly profit after years of losses.\nBut Tesla critics point out that its net income has never exceeded the money it gets from selling regulatory tax credits to other automakers for whom EV sales are a very small percentage of their overall sales. Those other automakers use the credits they purchase from Tesla to meet environmental standards, thus avoiding large fines.\nTesla got $518 million from those sales in the first quarter, but even Tesla admits it can't count on those sales to continue as other automakers start to sell more of their own EVs. The company's critics say it is proof that Tesla can't make money just from selling cars.\nIf its net income finally does exceed those credits, as the estimates suggest, it will be a significant milestone for the company, Ives said.\n\"That would throw one of the core bear arguments against the stock out the window,\" he said.\nWhat's going on with its bitcoin holdings?\nIn February, Tesla disclosed it used some of its cash on hand to purchase $1.5 billion in bitcoin. In April, it disclosed that it has sold some of those holdings and booked net income of $101 million from its crypto trading — adding to the argument that the company doesn't make money actually selling cars.\nThe bitcoin transactions made some investors nervous, said Ives, especially since the cryptocurrency has lost more than a third of its value since then.\nWhat's going on with supply chain issues?\nThe entire global auto industry is struggling with a computer chip shortage.\nWith other automakers ramping up production of their own EVs, Tesla now has greater competition for the raw materials that make up large EVe batteries, such as lithium.\nIn May, Musk tweeted that Tesla had to raise the price of its cars because of rising raw material costs. The outlook for raw material prices and the supply of parts such as chips and batteries will be a key to investors' expectations about Tesla sales the rest of this year.\nWhat's going on with new plants in Texas and Germany?\nTesla has a track record of getting new plants up and running much faster than traditional automakers.\nIt has a plant under construction near Austin, Texas, which will build the Model Y SUV and eventually the Cybertruck pickup, as well as another near Berlin to serve the European market, where it is losing ground on EV sales to Volkswagen (VLKAF).\nHaving two plants under construction simultaneously is the most ambitious expansion ever for Tesla, and the outlook for when the plants will be up to speed will be a key to investor expectations going forward.\nTesla said in April it expected both plants to have limited production later this year and \"volume production\" in 2022. It did not spell out what that means.\nWhat's the latest on the Cybertruck?\nWith a number of established automakers such as Ford (F) and General Motors (GM) on the verge of selling their own electric pickups, it's important that Tesla get the Cybertruck, its first pickup, into consumers' hands soon. In January, Musk said he was expecting \"volume production\" in 2022.\nThen in March he tweeted \"Update probably in Q2.\" He said the focus now was getting the Texas plant finished, calling that job a \"beast.\" Investors are anxious to get that update.\nWhat are plans to open Tesla's superchargers to other automakers' EVs.\nThis past week, Musk said in a tweet that \"we're making our Supercharger network open to other EVs later this year.\" As is often the case when he makes news via tweet, there were no details to help investors assess the business impact of such a move.\nIt could be significant. \"By 2030, we conservatively estimate Tesla supercharging revenue of $2.9 billion, a figure which does not include any revenue from non-Tesla vehicles,\" wrote Morgan Stanley auto analyst Adam Jonas in a note following the tweet.\nMusk will almost certainly be asked about the plans to open the network to other companies' cars during the conference call.\nWhat's the outlook for full self-driving cars?\nThis is one reason Tesla shares have so greatly outperformed traditional auto stocks: the belief of investors that it is closer to offering full self-driving cars, or FSD, than any other companies.\nMusk keeps promising advances for versions of FSD in his tweets. And Tesla CFO Zachary Kirkhorn spoke on the last earnings call about the potential for significant revenue from drivers who pay for FSD on a subscription basis.\nBut so far FSD has been more promise than reality. Investors will be eager to hear the latest outlook, and for the revenue that Tesla hopes to gain from it.\n"}