{"title":"Europe's central bank could print another $1 trillion and then some","date":"2021-07-22","classification":"good","text":"Title: Europe's central bank could print another $1 trillion and then some\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)Interest rates are primed to stay low in Europe for a very long time as central bankers add to the trillions they've already printed to stimulate the economy.\nThe European Central Bank signaled that it would keep interest rates low for longer on Thursday following a change in its approach to prices that will allow policymakers to keep pouring on stimulus until they're confident that inflation will get to 2% and stay there.\n\"Confirmation that the ECB is leaving its policy settings unchanged and will persist with ultra-loose policy for longer than implied by previous statements will come as no surprise to investors,\" said Andrew Kenningham, chief Europe economist at Capital Economics.\n\"However, today's policy statement is arguably a little more dovish than might have been expected because the Bank has set the bar to raising interest rates a little higher than it may have done,\" added Kenningham.\nRemember: The ECB announced earlier this month that it had abandoned its old policy of targeting inflation of \"below, but close to, 2%,\" a goal that many investors and economists found vague and confusing.\nInstead, the new-look ECB will pursue inflation of 2% in the medium term, and officials will have room to overshoot the target if needed.\nThe change comes as the central bank continues to gobble up bonds as part of its massive stimulus efforts.\nHow massive? Try $1,400,000,000,000. The ECB has purchased €1.2 trillion ($1.4 trillion) in bonds since March 2020 as part of its pandemic emergency response program.\nBut more is on the way. The central bank continues to snap up bonds at a rate of €80 billion ($94 billion) a month in the name of pandemic relief, with total purchases of €1.85 trillion ($2.2 trillion) authorized under the program.\nThat's on top of the roughly €20 billion ($24 billion) a month in bond purchases the ECB is making under a separate stimulus program that was initiated in 2014 called the Asset Purchase Program.\nPresident of the European Central Bank Christine Lagarde will host a press conference on Thursday.\nEconomists expect to learn more about the future of the bond-buying programs following ECB meetings in September or December.\nCrystal ball: Barclays analysts said ahead of Thursday's decision that they expect the central bank to end its pandemic bond-buying program in March 2022, assuming that the renewed surge in coronavirus cases doesn't send countries back into highly restrictive lockdowns.\nThere could be a digital euro by the middle of the decade\nBut that won't mean the end of stimulus. When the emergency pandemic program ends, Barclays expects the ECB to \"significantly\" increase bond purchases under the Asset Purchase Program.\nBarclays estimates the ECB will purchase a combined €700 billion ($825 billion) of bonds in 2022 under the two programs. That's on top of hundreds of billions due for the remainder of this year.\n\"We expect policy rates to remain at current levels and ECB purchases to continue in some form (via net purchases and reinvestment in 2022, and reinvestment thereafter) beyond our forecast horizon and at least until the end of the 2023 ECB forecast horizon,\" said the Barclays analysts.\nThat means the era of super-big stimulus is set to continue.\nThe door is closing on Chinese tech IPOs on Wall Street\nThings are looking pretty dire for Chinese tech right now, especially firms that have been considering overseas listings as a way to raise money. The chill created by tensions, both within China's borders and with the United States, could bring overseas investment in Chinese tech to a grinding halt.\nInvestors are already rattled. China's unprecedented tech crackdown has wiped $1 trillion off the value of overseas-listed Chinese tech stocks since February — one of the worst sell-offs in history, Goldman Sachs analysts said in a research report last week.\nAnd since shares in Didi crashed this month after its IPO in New York — a result of the massive scrutiny the ride-hailing company has faced from Chinese regulators and American lawmakers — a wave of other Chinese firms have reportedly backed off of plans to go public in the United States.\nIt \"may very well be\" the end — at least temporarily — to US listings for Chinese companies, according to Doug Guthrie, a professor and director of China Initiatives at Arizona State University's Thunderbird School of Global Management. He added that a \"serious pause\" on such listings could be in effect until US-China relations improve.\n\"The Chinese government is sending a very clear signal to Chinese tech firms and to the rest of the world, that Chinese organizations must work in lock-step with the Chinese government,\" Guthrie said. \"Companies that have grown too big and global too quickly will be reined in to ensure that they are working together with the Chinese government's priorities. \"\nRemember: US listings have long been an important way for Chinese companies to raise foreign capital. Despite tensions between the two countries, Chinese firms still raised about $13.6 billion from US listings last year, the best annual total since 2014 when Alibaba went public in a $25 billion New York IPO, according to data provider Dealogic. 2021 was also shaping up to be a bumper year before Didi's IPO.\nCheck out the full story from my CNN Business colleague Laura He.\nElon Musk wants bitcoin to succeed\nTesla CEO Elon Musk is one of the loudest voices in the cryptocurrency world. He frequently uses his massive platform on Twitter to post about various digital assets, and often causes wild swings in their prices.\nBut on Wednesday, Musk aimed to clarify that he's both a crypto investor and supporter, despite giving hints to the contrary recently, reports my CNN Business colleague Clare Duffy.\nSpeaking at an event alongside Twitter CEO Jack Dorsey and Ark Invest CEO Cathie Wood, Musk said the only major personal investments he has outside of his companies Tesla and SpaceX are in bitcoin, ethereum and dogecoin. He added that Tesla and SpaceX also own bitcoin.\nDespite the turmoil he's created in the crypto world, Musk said he is \"a supporter of bitcoin and the idea of cryptocurrency in general.\"\nRemember: Dogecoin plummeted in May after Musk appeared on Saturday Night Live and called it a \"hustle.\" That same month, Musk said Tesla would stop accepting bitcoin as payment because of the huge amount of energy used to mine it, causing the price to fall.\nIt's not always easy to parse Musk's statements on crypto. But now he's speaking like an investor.\n\"If the price of bitcoin goes down, I lose money,\" Musk said. \"I might pump, but I don't dump. ... I definitely do not believe in getting the price high and selling, or anything like this. I would like to see bitcoin succeed.\"\nUp next\nBefore the opening bell, investors will get a look at earnings from Abbott Labs, American Airlines, Blackstone, Biogen, Domino's Pizza, Southwest Air and Union Pacific.\nAlso today:\nEarnings from Intel, Snap, Twitter and Capital One are out after the close.\nUS jobless claims data will be published at 8:30 a.m. ET.\nUS existing home sales at 10:00 a.m. ET.\nComing tomorrow: Flash PMI data; American Express, Honeywell and Kimberly-Clark earnings\n"}