{"title":"Bitcoin, dogecoin and ethereum are suddenly having another great week","date":"2021-07-26","classification":"good","text":"Title: Bitcoin, dogecoin and ethereum are suddenly having another great week\nHong Kong (CNN Business)Cryptocurrencies rallied Monday, just a week after they were hit by a major sell-off.\nAs of 4:45 a.m. ET on Monday, bitcoin, ethereum and dogecoin had soared 10%, 7.3% and 11%, respectively, over the past 24 hours, according to data from CoinDesk.\nBitcoin climbed to a six-week high of nearly $38,133, while ethereum reached $2,330. Dogecoin was last trading at about 20 cents per coin, giving it a $28.8 billion market cap.\nThe surge came as major tech giants have signaled — or appeared to signal — their support for digital currencies through last week.\nFor one, speculation that \"Amazon may be preparing to accept digital coins as payment\" may have played a role in the rally, according to Jeffrey Halley, a senior market analyst for Asia Pacific at Oanda.\nThe conjecture was prompted by a job posting on Amazon's website for a \"digital currency and blockchain product lead.\"\nAccording to the job description — which was widely reported in various media outlets late last week — the executive would be expected to help Amazon's payments team develop \"new capabilities.\" The company did not immediately respond to a request for comment.\nBuoyed by Musk and Dorsey\nVirtual currencies have soared over the past week after bullish comments from Tesla (TSLA) and Twitter (TWTR) chief executives Elon Musk and Jack Dorsey, who have each shared how they have incorporated or plan to incorporate them in their businesses.\nThat came in contrast to a crypto downturn early last week, as investors were rattled about the Delta variant of the coronavirus. Bitcoin at the time fell below $30,000.\nBut then \"Elon rode to the rescue,\" according to Craig Erlam, a senior market analyst at Oanda.\nOn Wednesday, Musk said at an event with Dorsey that Tesla and SpaceX both own bitcoin (XBT).\nMusk has previously disclosed that Tesla had bought bitcoin, while SpaceX has claimed that it would accept dogecoin. The CEO also revealed last week that the only major personal investments he had outside of his companies, Tesla and SpaceX, were in bitcoin, ethereum and dogecoin.\nMusk, who is known for moving markets with his tweets, also posted a meme on Twitter over the weekend, which read: \"dogecoin is money.\"\nMusk has been outspoken on the topic, though his messaging on crypto has been mixed. In recent months, the prices of several cryptocurrencies, including the three that Musk owns, have been on a wild ride, partly in response to his statements and actions at his electric automaker and elsewhere.\nDogecoin plummeted in May after Musk appeared on \"Saturday Night Live\" and called it a \"hustle.\" That same month, Musk said Tesla would stop accepting bitcoin as payment because of the huge amount of energy used to mine it, causing the price to fall.\nLast week, however, Musk said that the company is keeping bitcoin on its books and will likely start accepting payments of the cryptocurrency again when around half of the power used to mine bitcoin comes from clean sources, such as solar and wind energy.\n\"Cryptocurrencies were given a helping hand by their old friend Elon Musk ... and it couldn't have come at a better time,\" Erlam wrote in a note over the weekend. \"The near-term outlook is looking a little brighter for cryptos.\"\nElon Musk says he's invested in bitcoin and wants to 'see it succeed'\nDorsey, meanwhile, told investors and analysts last week that bitcoin could become a major part of Twitter's strategy going forward.\n\"There are three trends relevant to Twitter and you, our shareholders: AI, decentralization and the Internet finally having access to a global native currency in bitcoin,\" Dorsey said on an earnings call last Thursday. \"We intend to lead the way in each.\"\nDorsey — whose other company, Square (SQ), has bought millions of dollars in bitcoin and started an initiative for crypto developers — added that when it came to the concept of \"the Internet having native currency ... bitcoin probably is the best.\"\nTwitter is having an inexplicably awesome 2021\n\"That's what I think we should really focus on. If the internet has a native currency, a global currency, we are able to move so much faster with products such as super follows, commerce, subscription, tip jar, and we can reach every single person on the planet because of that instead of going down [a] ... market-by-market approach,\" he said, noting that other social networks, such as Facebook (FB), had also jumped into the space.\n\"I think this is a big part of our future,\" he declared. \"There's an obvious need for this and appreciation for it.\"\n— Clare Duffy contributed to this report.\n"}