{"title":"Robinhood disappoints in first earnings report since market debut","date":"2021-08-18","classification":"bad","text":"Title: Robinhood disappoints in first earnings report since market debut\nNew York (CNN Business)Robinhood posted a big loss in its first earnings report since its volatile initial public offering last month, overshadowing the fact that sales more than doubled in the second quarter, led by strong demand for cyptocurrency trading.\nThe company reported revenue of $565 million in the quarter. Analysts were expecting sales of $521.8 million. Robinhood said this was the first time more new customers made their first trade in cryptos, such as bitcoin and ethereum, instead of stocks.\nExecutives noted on a conference call that more than 60% of the cryptocurrency trading volume in the second quarter was in dogecoin, the meme currency that has gotten a boost thanks to tweets by Tesla and SpaceX CEO Elon Musk.\nRobinhood added that its base of monthly active users more than doubled to 21.3 million in the second quarter of 2021, compared with 10.2 million a year ago.\nRobinhood stock gets off to rocky start 01:58\nBut the trading platform also reported a net loss of $502 million, or $2.16 per share. That was much bigger than Wall Street's forecasts. A big chunk of the loss was largely an accounting issue however, due to a change in fair value for convertible notes and warrant liability, according to the company.\nThe company warned that the third quarter, which is typically a seasonally weaker one for stocks, will lead to \"lower trading activity across the industry\" as well as \"lower revenues and considerably fewer new funded accounts than in the prior quarter\" for Robinhood.\nRobinhood's stock fell about 8% after hours following a nearly 7% pop during in-session trading Wednesday ahead of the earnings report.\nIt's already been a wild ride for Robinhood investors.\nThe stock stumbled out of the gate, falling more than 8% in its debut as investors questioned its valuation and criticized the company for temporarily not allowing customers to buy GameStop (GME) and other meme stocks touted by Reddit users earlier this year.\nRobihhood has also been accused of \"gamifying\" investing and catering to younger and less sophisticated traders.\nRobinhood had been sued by the family of a 20-year-old customer who died by suicide after mistakenly thinking he owed $730,000 on the app. Robinhood has since said in a regulatory filing that it has settled the case.\nBut following its early post-IPO growing pains, shares have roared back.\nAt one point earlier this month, Robinhood shares hit a high of $85 — nearly 125% above the offering price of $38 — as the trading platform became a meme stock in its own right.\nShares have since pulled back to just below $50. But the company is still worth more than $40 billion.\nRobinhood investors may have the last laugh after lackluster IPO\nRobinhood is hoping to make amends to traders who may feel disappointed by events of the past few months.\nIndividual investors asked questions on its conference call Thursday, a move similar to what movie theater chain and Reddit favorite AMC (AMC) did on its most recent earnings call.\nUsers were able to submit questions on a shareholder app called Say Technologies, which Robinhood agreed to buy last week for $140 million.\nAccording to Say Technologies, some of the more popular questions were about plans for new products such as cryptocurrency wallets as well as 401(k) and other retirement accounts, launches in international markets and whether investors would get swag like hats and hoodies.\n"}