{"title":"Central bank digital currencies are coming. The US must be prepared","date":"2021-08-13","classification":"good","text":"Title: Central bank digital currencies are coming. The US must be prepared\nEmily Parker is managing director at CoinDesk and a former policy advisor at the US State Department and writer/editor at The Wall Street Journal. She is author of \"Now I Know Who My Comrades Are: Voices From the Internet Underground.\" The opinions expressed in this commentary are her own.\nCryptocurrencies, like bitcoin and dogecoin, have dominated the news cycle in recent months. Meanwhile, the rise of another type of digital currency has gotten far less attention: central bank digital currencies (CBDCs).\nUnlike bitcoin, CBDCs are issued by governments and are basically digital versions of an existing national currency. But instead of holding it in your wallet, you store it on your phone.\nCBDCs could become more commonplace sooner than you'd think. According to the think tank Atlantic Council, 81 countries, which account for over 90% of the world's gross domestic product, are exploring a digital currency, and five countries have already launched one. And there will be more to come. According to a survey by the Bank for International Settlements, countries representing one-fifth of the world's population may well issue a digital currency in the next few years.\nLeading the race is China's digital yuan, which has already been trialed in over $5 billion worth of transactions. The US, by contrast, is still in the research phase. The House Committee on Financial Services recently had a hearing on the promises and perils of CBDC, in which several witnesses called on the US to be more proactive. Julia Coronado of MacroPolicy Perspectives called on the US to take a \"leadership role\" on CBDCs. \"Failing to act now will leave the US on the outside looking in,\" added the Atlantic Council's Julia Friedlander.\nIn other words, if America waits too long, it could miss a chance to shape the future of digital money.\nWhy should Americans care? Well, partly because they have gotten used to a world in which the US dollar reigns supreme. But the rise of CBDCs could challenge that order, potentially threatening the status of the US dollar as the global reserve currency. Different countries will have a much easier time transacting with each other directly, removing the need for the US dollar or SWIFT, a global financial messaging system.\nIn a CBDC world, \"people would use the dollar less,\" predicted Michael Sung, a professor at Shanghai's Fudan University who researches digital currencies, in an interview with me. \"The dollar is dominant because it is the reserve currency. Everyone needs to use it for convenience. You don't need a reserve currency if you can do direct settlement between trade pairs.\"\nThe dollar is also a tool for US foreign policy, in that the US can essentially bar sanctioned countries from the dollar-based system. If the US doesn't develop its own CBDC and other countries move ahead, it might have less information about cross-border transactions since countries could transact with each other without using the SWIFT network, which the US can monitor.\nTying CEO pay to carbon emissions works. More companies should try it\nCBDCs could bring a domestic advantage for the US as well. In his Senate testimony on a digital dollar, Stanford University professor Darrell Duffie noted that part of the appeal of CBDCs lie in finding an alternative to our current costly and inefficient bank-railed system. \"Banks have also underinvested in payment technologies that would improve the speed, interoperability and programmability of payments,\" Duffie said.\nDigital currencies can be programmed to be spent in a certain way — say for food and medical supplies, but not for cigarettes or alcohol. Of course, many Americans would understandably be uncomfortable with the idea of the government knowing how your digital money is spent. And there is reason to fear that CBDCs will become a convenient way for authoritarian governments to monitor individual citizen transactions. But that doesn't have to become the dominant model.\nThe US could help set the standard by developing a digital currency that has privacy at its core. \"If this is going to be the tech of the future, we want to make sure the US brings democratic values to bear,\" Chris Giancarlo, co-founder of the Digital Dollar Project, said in an interview with me.\nA digital dollar should also be a tool for certain use cases, such as delivering government aid in the case of a pandemic, not an end all be all. It should not eliminate cash, which is still the most private form of money. Nor should it intend to replace non-government digital currencies like Bitcoin, dollar-pegged stablecoins or other cryptocurrencies that allow for more private transactions.\nWe may soon be living in a CBDC world. And if America stays on the sidelines, it could miss its chance to influence what that world looks like.\n"}