{"title":"AMC is playing to the Reddit crowd","date":"2021-08-10","classification":"good","text":"Title: AMC is playing to the Reddit crowd\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)If there was ever any doubt that individual investors are a powerful new force on Wall Street, AMC Entertainment (AMC) CEO Adam Aron may just have silenced the skeptics.\nThe latest: On the company's earnings call Monday, Aron made it very clear through his choice of words — and downright flattery — that he views retail investors as crucial to the movie theater chain's fortunes.\nIt's not altogether surprising, given that AMC — which had to close all of its cinemas during the peak of the pandemic last year — has been a major beneficiary of the meme stock phenomenon, in which retail investors pour billions of dollars into often troubled companies.\nThe company posted a loss for the three months ended June, but it was narrower than analysts expected and revenue came in ahead of forecasts.\nAdam Aron, the CEO of AMC Entertainment, at one of the company's theaters in Leawood, Kansas.\n\"In short, AMC crushed it in Q2,\" Aron said on the call, adopting the Reddit crowd's lingo. Later, Aron highlighted the fact that AMC has implemented some of the \"great ideas\" that individual investors have \"showered\" it with, including screening professional sporting events and concerts.\nHe answered around a dozen questions submitted by individual investors. \"Can you guys make the AMC mascot officially a gorilla?,\" Aaron asked, reflecting the tendency of Reddit investors to refer to each other as \"apes.\" \"Would AMC ever consider reestablishing drive-in theaters?,\" Ryan wanted to know.\nBy comparison, Aron took questions from just one analyst — down from about six a year ago — blaming time constraints for cutting it short.\nThe reaction: The stock gained Monday and is up nearly 9% premarket. AMC's newest shareholders raved about Aron's performance on social media platforms such as Reddit afterwards. \"Silverback Adam crushed the earnings call. If you're \"in this to win this\", you should listen to it,\" wrote one observer on Twitter.\nAMC says it'll soon let you pay for your movie ticket in bitcoin\nWhat it means: Individual investors matter and companies are embracing them for good reason.\nAMC's stock is up over 1,500% so far this year and it was able to raise $587 million in June as meme traders piled in, even though none of the analysts who cover the company recommend buying the stock and theater attendance remains way below pre-pandemic levels.\nWatch this space: Playing to another online crowd favorite, AMC announced that it would start rolling out technology to let moviegoers in the United States pay for their tickets and snacks in bitcoin by the end of the year.\nIt is also buying up American theaters and plans to open about a dozen new venues in the United States, Europe and the Middle East this year, betting that consumers will return to the movies once the pandemic subsides.\n\"We fundamentally believe that ours is a future that is bright because there is nothing as magical as seeing dazzling images on a huge silver screen,\" Aron said on the call.\nCompanies have nowhere to hide on climate\nBusinesses that don't have a plan in place to cut their carbon emissions may soon find themselves on the receiving end of shareholder revolts.\nWhat's happening: On Monday, the United Nations' Intergovernmental Panel on Climate Change warned the world has rapidly warmed 1.1 degrees Celsius higher than pre-industrial era levels and is now careening toward 1.5 degrees — a critical threshold with dire global consequences.\nBig Oil wants to keep drilling in the North Sea. The backlash is growing\nThe shocking assessment will only increase pressure on companies to scale up climate action in order to reach the goals of the Paris Agreement.\n\"The science is crystal clear but the response is not. Investors must use their influence to push decision makers to make the bold emission reductions required to limit the most severe consequences of climate change,\" Wai-Shin Chan, global head of environmental, social and governance research at HSBC (HSBC), told Reuters.\nSee here: In one of the latest signs of the growing backlash that polluters face, Greenpeace is threatening to sue if Britain green-lights a new crude oil development in the North Sea.\nThe project is co-owned by Siccar Point Energy and Shell (RDSB), which is trying to drum up confidence among shareholders in its plan to make its business greener. The oil producer may need to try harder.\nRead more about the Cambo development controversy here from my CNN Business colleague Julia Horowitz.\nHow to retire early\nEarly retirement has long been seen as the preserve of a lucky few who hit the big time in their 30s or 40s, often with a high-stakes bet on a business venture that turns out to be a major success. That may be changing.\nThe Financial Independence Retire Early movement — known as FIRE — is a method of living below your means to obtain financial independence as early as possible, my CNN Business colleague Jazmin Goodwin reports.\nYou might be able to retire earlier than you think. Here's how\nHow it works: FIRE focuses on keeping expenses low and savings high. People pursuing this goal start by picking a \"FIRE number,\" which is the amount of money they need to save to generate enough income to cover expenses without having to work.\nGenerally, this means saving anywhere between 50% to 75% of annual income to retire well before the age of 65 and usually without any debt.\nBottom line: \"Those looking to retire early need to widen the gap between what they earn and what they spend,\" explains Danielle R. Harrison, founder and president at Harrison Financial Planning.\nUp Next\nSysco (SYY) reports earnings before the opening bell. Coinbase Global, McAfee, Poshmark and Stride report earnings after US markets close.\nComing tomorrow: Wendy's (WEN), Bumble and eBay (EBAY) earnings.\n"}