{"title":"AMC says it'll soon let you pay for your movie ticket in bitcoin","date":"2021-08-10","classification":"good","text":"Title: AMC says it'll soon let you pay for your movie ticket in bitcoin\nHong Kong (CNN Business)AMC is jumping on the crypto bandwagon.\nIn an earnings call Monday, the theater chain announced that it would start rolling out technology to let moviegoers in the United States pay for their tickets and snacks in bitcoin (XBT) by the end of the year.\n\"I've had to learn more in the past six months about blockchain and cryptocurrency than I learned about it in the entire decade before that,\" said CEO Adam Aron.\nHe added that the company was also \"exploring how else AMC (AMC) can participate in this new burgeoning cryptocurrency universe, and we're quite intrigued by potentially lucrative business [opportunities].\"\nFor now, the move would allow customers to buy tickets and concessions online using bitcoin for all of AMC's US theaters. Aron said that \"since we had to do the IT programming to accept bitcoin anyway, we are simultaneously writing the code right now to accept Apple Pay and Google Pay for online purchases at our US theaters also.\"\nInvestors cheered the news. AMC shares jumped 5.3% in after-hours trading. Bitcoin was up 5.5% Monday night from a day earlier.\nAmazon posted a crypto job. Bitcoin surged 14%\nAs cryptocurrencies become more mainstream, a growing number of companies are exploring how to incorporate them in their businesses.\nLast month, virtual currencies soared after bullish comments from Elon Musk and Jack Dorsey, the CEOs of Tesla (TSLA) and Twitter (TWTR), respectively.\nMusk had disclosed at the time that two of his companies — Tesla and SpaceX — both owned bitcoin, while Dorsey said that the cryptocurrency could become a major part of Twitter's strategy going forward.\nThat week, news of an Amazon (AMZN) job posting also sent bitcoin surging. The company said it was recruiting for a \"digital currency and blockchain product lead,\" who would be expected to help its payments team develop \"new capabilities.\"\n\"We're inspired by the innovation happening in the cryptocurrency space and are exploring what this could look like on Amazon,\" a spokesperson for the company told CNN Business at the time.\n\"We believe the future will be built on new technologies that enable modern, fast and inexpensive payments, and hope to bring that future to Amazon customers as soon as possible.\"\n"}