{"title":"Bitcoin drops below $43,000 on El Salvador's first day using it","date":"2021-09-07","classification":"bad","text":"Title: Bitcoin drops below $43,000 on El Salvador's first day using it\nNew York (CNN Business)It's a volatile day for bitcoin, which briefly fell by more than 10% Tuesday — below the $43,000 mark.\nThe drop comes after El Salvador made good on a plan announced in June and adopted the cryptocurrency as legal tender, making it the first country in the world to do so.\nThe move received some criticism in El Salvador, where people protested, as well as abroad.\n\"The country needs a stable currency system and efficient payment system. To the extent that El Salvador's government or bank would not create a central bank digital currency, it makes more sense for them to adopt another major stable digital currency, whether it is centrally offered or decentralized,\" said Will Cong, professor of finance at Cornell University, in emailed comments.\nStill the adoption as legal tender was in principle good news for the mainstreaming of bitcoin. But the crypto fell Tuesday on the \"buy the rumor, sell the news\" phenomenon related to the Salvadoran policy finally coming to be, said Edward Moya, senior market analyst at Oanda.\nThe Central American nation had bought 200 bitcoins previously, and it purchased another 200 late Monday ahead of the formal adoption plus another 150 on Tuesday, bringing the country's total to 550 bitcoins. It will also give residents $30 worth of bitcoin with the download of the state-run Chivo wallet app to incentivize citizens to try crypto payments.\nBitcoin had traded as high as nearly $53,000 per coin Monday on the Salvadoran activity.\nAs the New York stock exchange opened Tuesday, the digital currency was more or less flat, and by midday it had fallen to a 24-hour low of $42,921, according to CoinDesk data.\nSalvadoran President Nayib Bukele, a right-wing populist who rose to power in 2019, tweeted around midday that he was \"buying the dip.\"\nEven though the crypto has come off its lows, it was trading down about 9.5% mid-afternoon. Bukele tweeted earlier that \"it appears the discount is ending.\"\n--CNN Business' Merlin Delcid contributed to this report.\n"}