{"title":"El Salvador buys bitcoin as the digital currency becomes legal tender","date":"2021-09-07","classification":"good","text":"Title: El Salvador buys bitcoin as the digital currency becomes legal tender\nSan Salvador, El Salvador (CNN Business)El Salvador became the first country to adopt bitcoin as a national currency on Tuesday, kicking off a radical monetary experiment that could pose risks to the fragile economy.\nPresident Nayib Bukele announced late Monday that his government purchased 200 bitcoins ahead of El Salvador's formal adoption of the currency. He added another 150 on Tuesday, bringing the country's total to 550 bitcoins.\nBitcoin is now legal tender in El Salvador alongside the US dollar. On Tuesday, the risks of the approach were highlighted when bitcoin prices dropped sharply on what Bukele has called \"Bitcoin Day.\"\nBukele, a right-wing populist who rose to power in 2019, announced the plan to start using bitcoin in June. The law designating bitcoin as legal tender says that all \"economic agents\" shall accept the cryptocurrency as a form of payment. It also says that tax payments can be made in bitcoin.\nEl Salvador is the first country to adopt bitcoin as legal tender\nSalvadorans will be able to download the \"Chivo Wallet,\" an application created by the government which will deliver $30 worth of bitcoin to people to promote its use.\n\"The process of #Bitcoin in El Salvador has a learning curve. Every step toward the future is like this, and we will not achieve everything in a day, nor in a month,\" Bukele tweeted. \"But we must break the paradigms of the past.\"\nSome citizens have embraced the technology, while others are wary. José Abraham Cerón, a baker, told CNN that it's not difficult to deal in bitcoin. But Blanca Estela Ponce, the owner of a nearby tortilla shop, said she prefers cash.\n\"[Bitcoin is] something new and we don't have enough information about it,\" Ponce told CNN.\nEl Salvador has partnered with digital finance company Strike to create the infrastructure required.\nCryptocurrencies are held in digital wallets, rather than through a traditional bank account — meaning that people in poorer communities with less access to banks could use bitcoin as a way to gain increased access to their finances.\nHowever, social organizations have asked the Salvadoran government to repeal the law, largely because they fear the extreme volatility of the cryptocurrency.\nBitcoin has recovered some lost ground following a dramatic crash earlier this year, but it remains well below its record high of nearly $65,000 set in April. The price was $46,930 on Tuesday, down 9.1% in the past 24 hours, according to Coinbase.\nThe International Monetary Fund, which provided an emergency loan to El Salvador last year and is now negotiating another round of lending, has taken a dim view of using bitcoin as legal tender, saying that doing so raises a number of economic, financial and legal issues.\n\"How do we know what we collect in taxes when bitcoin goes up and bitcoin goes down? How do we plan for expenditures? Remember in April, bitcoin crossed $65,000 and then it dropped almost half of it. That is a problem that the ministry of finance is going to be wrestling with. And it is not an easy one,\" Kristalina Georgieva, managing director of the IMF, said recently.\nIn late July, Moody's Investors Service pushed El Salvador's debt rating deeper into junk territory, citing \"a deterioration in the quality of policymaking\" including the government's decision to adopt bitcoin as legal tender.\nMoody's said the country remains susceptible to financing shocks that could jeopardize the government's ability to repay creditors starting in January 2023.\nEl Salvador's government is betting that using bitcoin as legal tender will attract new investments. Authorities also hope to reduce commissions paid for sending remittances from abroad.\n-- Joshua Berlinger, Rafael Romo, Charles Riley and Jill Disis contributed to this report.\n"}