{"title":"George Soros calls out BlackRock's 'China blunder'","date":"2021-09-07","classification":"bad","text":"Title: George Soros calls out BlackRock's 'China blunder'\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)George Soros, the billionaire financier and philanthropist, thinks BlackRock has made a huge miscalculation on China.\nWhat's happening: Soros called out the world's largest asset manager in an op-ed published by the Wall Street Journal on Monday titled \"BlackRock's China Blunder.\"\nBlackRock (BLK) recently started offering investment products to individual Chinese investors as the country's first entirely foreign-owned fund management firm. But Soros slammed the move, claiming the company \"appears to misunderstand President Xi Jinping's China.\"\n\"Pouring billions of dollars into China now is a tragic mistake,\" he wrote. \"It is likely to lose money for BlackRock's clients and, more important, will damage the national security interests of the [United States] and other democracies.\"\nBreaking it down: Soros highlighted Xi's recent crackdown on private business, which he sees as proof that \"the regime regards all Chinese companies as instruments of the one-party state.\" He also referenced \"an enormous crisis brewing in China's real estate market,\" and Xi's efforts to redistribute wealth. These trends, he said, do \"not augur well for foreign investors.\"\nSoros also thinks that BlackRock's initiative is a threat to democracies because \"the money invested in China will help prop up President Xi's regime, which is repressive at home and aggressive abroad.\"\nBlackRock declined to comment. In the past, CEO Larry Fink has made clear that he sees the Chinese market as a massive opportunity that can't be passed up.\n\"Rapid economic development and wealth accumulation in the world's second-largest economy has propelled the growth of the $9 trillion Chinese domestic asset management industry,\" he told analysts in July. \"We are now well positioned to extend the breadth of our investment solutions and insights to all our client segments across China and help more people transition their savings to investments in China.\"\nBig picture: Soros is a longtime critic of Xi. Still, he's surfacing very real concerns among investors about what Beijing's latest broadsides against firms like Alibaba and Didi mean for long-term investment prospects.\nFor now, his warnings are being brushed aside. My CNN Business colleague Laura He recently reported that heavyweight global investment firms are sticking with China despite the ruling Communist Party's sweeping efforts to curb the power of top tech and education companies.\nIn addition to BlackRock, Fidelity, Pictet and Goldman Sachs (GS) are advising clients to stay invested in the Chinese market, albeit cautiously.\n\"The case for China in the long-term is intact,\" Luca Paolini, chief strategist for Pictet Asset Management, told Laura.\nThe S&P/BNY Mellon China Select ADR Index, which tracks American depository receipts of top US-listed Chinese firms, has risen 8% in the past week, though it's still off 19% over the past three months. But as Xi's campaign against private businesses continues, voices like Soros could start to carry more weight.\nIt's 'Bitcoin Day' in El Salvador\nEl Salvador has become the first country to adopt bitcoin as legal tender in a risky bid by President Nayib Bukele to boost the country's economy.\nThe latest: As of Tuesday, bitcoin is a formally recognized form of payment in El Salvador alongside the US dollar. Bukele announced late Monday that his government now holds 400 bitcoins, worth nearly $21 million at current trading levels.\nEl Salvador buys 200 bitcoins as the digital currency becomes legal tender\nBukele, a right-wing populist who rose to power in 2019, is working to make \"Bitcoin Day\" something of a national holiday. Salvadorans will be able to download the \"Chivo Wallet,\" an application created by the government that will deliver $30 worth of bitcoin to people to promote its use.\n\"The process of #Bitcoin in El Salvador has a learning curve,\" Bukele tweeted. \"Every step toward the future is like this, and we will not achieve everything in a day, nor in a month. But we must break the paradigms of the past.\"\nThe rationale: Cryptocurrencies are held in digital wallets, rather than in traditional bank accounts. That could give people in poorer communities in El Salvador, which the World Bank notes suffers from \"persistently low levels of economic growth,\" greater access to their finances.\nThe country's government is also betting that its bitcoin approach will lure foreign investment.\nThat said: Bitcoin's massive volatility poses concerns. While the digital currency recovered some lost ground following a dramatic crash earlier this year, it remains well below its record high of nearly $65,000 set in April.\nIn a blog post published in July, the International Monetary Fund said that using crypto as national currency was \"a step too far.\" It warned that such a policy would generate economic instability and wild prices, and could trigger a spike in financial crime.\nRegulators fear Kim Kardashian and crypto FOMO\nRegulators are worried about all the people plugging cryptocurrencies online. That includes Kim Kardashian, beauty and fashion mogul and influencer extraordinaire.\nCharles Randell, chair of the UK Financial Conduct Authority, called out Kardashian in a colorful speech Monday.\nHe started out by suggesting that the internet was full of ... excrement.\n\"The Augean stables hadn't been cleaned for 30 years when Hercules was set the labor of cleaning them. For 30 years, 3,000 animals had been doing in those stables what 3,000 animals have to do,\" Randell said. \"The first website was published 30 years ago last month. And like the Augean stables, over the last 30 years the internet has filled up with a great deal of ... well, let's just call it 'problematic content.'\"\nHe then trained his attention on Kardashian, who, he noted, recently plugged \"Ethereum Max\" to 250 million Instagram followers.\n\"In line with Instagram's rules, she disclosed that this was an #AD,\" Randell said. \"But she didn't have to disclose that Ethereum Max — not to be confused with ethereum — was a speculative digital token created a month before by unknown developers, one of hundreds of such tokens that fill the crypto-exchanges.\"\nStep back: Randell acknowledged that he can't say whether this particular token is a scam. But he emphasized that regulators needed to do more to rein in this type of online activity. Platforms like Facebook, Twitter and TikTok, he said, also need to \"step up.\"\n\"The hype around [cryptocurrencies] generates a powerful fear of missing out from some consumers who may have little understanding of their risks,\" Randell said.\nAnd he had a clear reminder for prospective consumers: \"These tokens are not regulated by the FCA. ... If you buy them, you should be prepared to lose all your money.\"\nUp next\nEarnings from GameStop (GME) and Lululemon (LULU) arrive Wednesday.\n"}