{"title":"Wall Street's hottest investor is betting big on a handful of stocks. Critics say she's playing with fire","date":"2021-09-07","classification":"good","text":"Title: Wall Street's hottest investor is betting big on a handful of stocks. Critics say she's playing with fire\nNew York (CNN Business)At a time when many investors are content to follow the crowd and buy top techs like Apple, Amazon and Microsoft, Cathie Wood is looking for the next big innovators in buzzy fields like robotics, fintech and space exploration.\nIt's a high-flying, high-risk, high-reward tier of investing. And it's put Wood's fans on a white-knuckle ride in 2021.\nLast year, Wood's strategy paid huge dividends for investors in her flagship Ark Innovation (ARKK) exchange-traded fund. It surged nearly 150% in 2020 and helped turn her into a Wall Street superstar — sort of the Warren Buffett of momentum investing.\nCathie Wood, CEO of Ark Investment Management, has become the face of the growth stock movement on Wall Street.\nBut this year hasn't been nearly as kind to Wood as the last. The Innovation ETF was down 2.5% through late August, despite a red-hot market for tech with the Nasdaq up more than 18% so far in 2021.\nWood wasn't available to comment for this story, but she doubled down in an interview with CNBC in August. She's not worried that the Ark strategy of looking for new tech leaders will end badly, and she maintains that this current rally will not be a repeat of the epic 2000 dot-com implosion.\n\"I don't think we're in a bubble, which is what I think many bears think we are,\" Wood told CNBC. \"We have nothing like that right now. In fact, you see a lot of IPOs or SPACs coming out and falling to Earth. We couldn't be further away from a bubble.\"\nHow Wood developed her strategy\nWood speaks from experience. She's no millennial or Gen Z investor for whom the 2000 tech implosion is merely a war story told by older traders. The 65-year-old Wood lived through the last major tech crash, as well as the infamous Black Monday of 1987.\nShe worked for Prudential-owned money manager Jennison Associates for 18 years in the 1980s and 1990s and then spent a dozen years at AllianceBernstein before leaving in 2013.\n\"I have been watching disruptive innovation for my entire career — why don't I help my own sector along?\"\nBut then, AllianceBernstein passed on her idea to launch a suite of actively managed exchange-traded funds. So she struck out on her own and started Ark in 2014.\n\"I have been watching disruptive innovation for my entire career — why don't I help my own sector along?\" she told Forbes in a 2014 interview.\nThat focus on disruption means Wood ties her ETF's fortunes to visionary but mercurial leaders.\nIn the most prominent example, Wood remains an unabashed fan of Tesla (TSLA) and CEO Elon Musk. The EV maker is the top stock, by far, in Ark's Innovation ETF, accounting for more than 10% of the fund's holdings. It's also the biggest position in Ark's Autonomous Technology & Robotics (ARKQ) and Next Generation Internet (ARKW) ETFs.\nWood is a vocal fan of Tesla, which is a top holding in several of Ark's funds.\nWood is also OK with companies like Tesla issuing more stock to raise money to fund futuristic projects like autonomous vehicles. Some investors are wary of that strategy because the new shares lower the value of existing investors' holdings, but she thinks that's a short-sighted argument, particularly from Tesla bears.\n\"We're not afraid of dilution ... if we think they're doing it for the right reason,\" she told CNBC. \"We wanted them to scale as quickly as possible because we think if we're right on autonomous ...Tesla could get the lion's share of that market, certainly in the United States.\"\nYou don't have to be rich to cash in on the space race\nArk's big investment in Tesla is a bet on Musk continuing to innovate beyond the business of electric cars, Wood explained in an interview with Bloomberg Radio in August. She raved about Tesla's plans to build a humanoid robot, for example.\n\"Every passing day, especially the more we learn about their AI expertise and how they're really driving the space ... we believe they have the pole position,\" she said, noting that Ark analysts were \"blown away\" by Musk's presentation.\nGrowth at all costs\nWood recognizes her growth-at-all-costs way of investing is not for everyone.\nTesla has lagged the broader market this year. Shares of Teladoc (TDOC), a telehealth company that is the second-largest holding in the Ark Innovation ETF and was a big winner at the start of the pandemic, are down more than 25% in 2021.\n\"We've seen higher-valuation stocks hit hard this year. But the growth for these innovative companies will still be treated well over time,\" Wood said during a webcast hosted by Cboe Global Markets in March.\nWood added that she thinks investors also should put a small percentage of their money in bitcoin, another risky bet. And she stressed that investors have to overlook the inevitable short-term bumps that come with any asset. It's essential to maintain longer-term convictions and invest for future growth, Wood believes.\nInvestment manager: Worries about China are overdone 02:31\n\"A lot of companies catering to short-term investors who wanted profits now [have] invested more in stock buybacks and dividends over innovation,\" she said. \"That puts them in harm's way.\"\nA colleague describes Wood's go-big-or-go-home approach as a model for the new way of investing. Too many fund managers are afraid to look far into the future when judging a company's merits, instead focusing myopically on the prior and next quarterly earnings reports.  \n\"Cathie has been focusing on Tesla for a long time. She looks at it not just as an automobile manufacturer. You can't compare it to traditional car companies,\" Ark Invest's Ren Leggi, who works closely with Wood on investment decisions as the company's client portfolio manager, told CNN Business in March.\nWood's critics\nBut a growing chorus of skeptics think Wood's funds could eventually collapse. Michael Burry, one of the super-bearish investors made famous in \"The Big Short,\" recently established a short position on the Ark Innovation ETF — essentially betting that it will fall sharply.\nSome tech stock veterans also wonder if Wood is just an investing flavor of the month, comparing her to once-popular portfolio managers like Kevin Landis of Firsthand Funds, Alberto Vilar of Amerindo and Garrett Van Wagoner, who ran a popular emerging-growth fund in the late 1990s.\nMany of those tech funds imploded following the 2000 bubble. The Wall Street Journal wrote a catch-up piece about Van Wagoner and other late 1990s tech gurus in 2010 with the headline \"From Fame, Fortune to Flamed-Out Stars. Post-Bust Fates of Tech-Fund Mavens.\"\nIs Wood destined for similar ignominy?\nRivals take issue with Wood making such big bets on only a handful of stocks. The Ark Innovation ETF, for example, has nearly half its assets concentrated in its top 10 holdings. Beyond Tesla, that fund also owns sizable stakes in Roku (ROKU), Coinbase, Zoom (ZM) and Square (SQ).\nRoku is another example of a high-risk/high-reward stock that Wood loves.\n\"Our investment approach is similar to Ark in that we are focusing on tech. But we're different in that we avoid concentration,\"Jeremie Capron, head of research at ROBO Global, told CNN Business in March.\nThe top 10 holdings in the ROBO Global Robotics and Automation Index (ROBO) ETF account for less than 20% of the fund's total assets, and the fund owns about 80 stocks. Ark funds typically own shares in only about 30 to 50 companies.\nFor the time being, Wood is having the last laugh.\nYes, her fund's returns may be volatile year-to-year — the Ark Innovation ETF fell nearly 25% in 2018 before rebounding 30% in 2019 — but it has tended to smooth out. The five-year average annualized return for the Ark Innovation ETF through mid-2021 was 48.6%, compared to 17.7% for the S&P 500.\nAs long as that long-term trend continues, Ark acolytes may forgive a down year every now and then as Wood continues to swing for the fences.\n"}