{"title":"Remember NFTs? They're back, big time","date":"2021-09-05","classification":"good","text":"Title: Remember NFTs? They're back, big time\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)Plenty of ink was spilled earlier this year when investors, hobbyists and art enthusiasts started frantically buying up non-fungible tokens, or NFTs, in another crypto world craze.\nBreaking it down: NFTs transform digital works of art and other collectibles into one-of-a-kind, verifiable assets that are easy to trade on the blockchain. Notable examples include a decade-old \"Nyan Cat\" GIF, which sold for $600,000, and Twitter CEO Jack Dorsey's first tweet, which hauled in $2.9 million.\nThen the fervor subsided, and it looked like what some were calling a speculative bubble had popped. But last month, interest in NFTs surged again — triggering a new frenzy.\nMonthly sales on OpenSea, the top platform for buying and selling NFTs, reached $3.4 billion in August, easily an all-time high, according to data from Dune Analytics. September is already the second-best month ever, with $485 million in sales as of Friday.\nCelebrity attention has helped feed the hype. NBA star Steph Curry reportedly just paid $180,000 for an NFT from Bored Ape Yacht Club, one of the highest-profile NFT projects. He changed his Twitter avatar to display his prize: the image of a blue monkey in a tan suit.\nDanny Adkins, co-founder of MomentRanks, a platform that provides analytics and tools for NFT collectors, said that people like Curry are helping validate digital brands like Bored Ape, giving them the cachet that celebs usually lend to labels like Gucci or Supreme.\n\"Athletes and celebrities want to show them off,\" Adkins told me. That's helping the NFT industry build \"clout.\"\nAuction houses have served a similar function. NFTs really started generating public attention after a JPEG file by the digital artist Beeple sold for $69 million at Christie's in March. This week, Sotheby's will auction off a lot of Bored Ape NFTs, which it expects could fetch as much as $18 million.\nA set of Bored Ape Yacht Club NFTs is being auctioned off at Sotheby's.\nWatch this space: Most NFTs are purchased using ethereum. The digital currency launched a robust price recovery last month, rallying 36%. It's now trading just below $4,000, not far from the record high it hit before cryptocurrencies crashed in May.\nWhere does it end? Les Borsai, co-founder of Wave Financial, a Los Angeles-based digital asset investment management firm, dismisses the idea of a \"bubble\" given the technology that underlies NFTs.\nHe points to all the ways digital art and collectibles can be monetized, including through the fast-growing world of blockchain-based gaming.\n\"A tulip was a tulip,\" Borsai told me, alluding to Dutch tulip mania in the early 17th century, which was one of the most famous market bubbles in history. \"These things do have completely robust technologies connected to them.\"\nWhy everyone is watching the trial of Elizabeth Holmes\nThe trial of Elizabeth Holmes, the former CEO and founder of Theranos, kicks off in earnest this week.\nOn the calendar: Opening statements are scheduled for Wednesday, reports my CNN Business colleague Sara Ashley O'Brien, who is covering the proceedings from the courtroom in San Jose.\nJury in criminal trial of Elizabeth Holmes has been selected\nHolmes was indicted more than three years ago on a dozen federal fraud and conspiracy charges over allegations she knowingly misled investors, patients and doctors about the capabilities of her company's proprietary blood testing technology. She has pleaded not guilty and faces up to 20 years in prison.\nThe trial, which has been delayed several times due to the pandemic and the birth of Holmes' first child in July, is expected to last roughly 13 weeks.\nTime machine: In the company's heyday, Holmes, 37, was the subject of much fascination. A Stanford University dropout with a stated fear of needles, she founded Theranos in 2003 to revolutionize blood testing.\nHolmes raised hundreds of millions of dollars from high-profile individuals including media mogul Rupert Murdoch, Oracle founder Larry Ellison, Walmart's Walton family and former Secretary of Education Betsy DeVos. She was lauded on magazine covers as the richest self-made woman and \"the next Steve Jobs,\" an image she helped cultivate by dressing the part in her signature black turtleneck. At its peak, her startup was valued at $9 billion.\nThat image shattered in the wake of reporter John Carreyrou's 2015 investigation for the Wall Street Journal. In recent years, Holmes has instead been portrayed as a con artist who played to Silicon Valley's worst impulses.\nReality check: The cautionary tale of Theranos has done little to curb the hype around health startups, however. In the first quarter of 2021, venture capital funding for retail health and wellness tech companies set a record, with $4.2 billion invested in 153 deals, according to PitchBook.\nUp next\nMonday: US markets closed\nTuesday: Bitcoin becomes legal tender in El Salvador; Reserve Bank of Australia policy decision\nWednesday: GameStop (GME) and Lululemon (LULU) earnings; Opening statements in Elizabeth Holmes trial\nThursday: China inflation data; European Central Bank policy decision; US initial unemployment claims; Affirm and American Outdoor Brands (AOBC) earnings\nFriday: US Producer Price Index; Kroger (KR) earnings\n"}