{"title":"Bitcoin's price rises above $50,000 for the first time since May","date":"2021-08-23","classification":"good","text":"Title: Bitcoin's price rises above $50,000 for the first time since May\nNew Delhi (CNN Business)Bitcoin has surged above the $50,000 mark, as the virtual currency continues to climb out of a months-long slump.\nIt's the first time bitcoin has reached that milestone since May 15. Bitcoin's peers also advanced: Ethereum was up more than 3%, while dogecoin rose nearly 2%.\nBitcoin had been inching near that mark all weekend before finally crossing it during Sunday evening hours Eastern Time, according to data from CoinDesk.\nThe cryptocurrency is also getting a lift after PayPal (PYPL) announced that it will allow people to buy, hold and sell four types of cryptocurrencies — bitcoin, ethereum, litecoin and bitcoin cash — in the United Kingdom.\nThis announcement marks the first international expansion of the company's cryptocurrency offering outside of the United States, where it launched the service in October last year.\nWith this move, the \"access, knowledge, and the exploration of cryptocurrency has the potential to become mainstream in the UK,\" the company said in a statement.\nIt's been a turbulent few months for cryptocurrency. Bitcoin, which hit an all-time high of nearly $65,000 in April, plummeted to as low as $28,800 in June after China escalated its crackdown on digital currencies.\nBitcoin, which had been hovering between $30,000 and $40,000 for many weeks, began to rise out of its slump last month, when major tech giants signaled — or appeared to signal — their support for digital currencies.\nIn July, Amazon (AMZN) posted a job opening for a digital currency and blockchain product lead, sending cryptocurrencies soaring. The listing generated buzz about the tech company's future involvement with cryptocurrencies and its potential to further legitimize the nascent digital currency sector.\nBitcoin and its ilk also got a boost last month from bullish comments by Tesla (TSLA) and Twitter (TWTR) chief executives Elon Musk and Jack Dorsey, who each shared how they have incorporated or plan to incorporate digital currencies in their businesses.\n"}