{"title":"How is Delta affecting the economy? The jury is out","date":"2021-08-23","classification":"good","text":"Title: How is Delta affecting the economy? The jury is out\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)The Delta variant of Covid-19, which has caused a sharp rise in coronavirus cases in countries around the world, is a major risk to the recovery from the pandemic. And in some places, clear signs of damage are cropping up.\nWhat's happening: IHS Markit released preliminary readings from its closely-watched surveys of purchasing managers on Monday. The data showed that in many advanced economies, the more contagious Delta strain is having a real impact.\nIn Australia, business activity in the private sector fell for the second straight month, with the pace of contraction increasing since July.\n\"Survey respondents signaled that the increase in Covid-19 cases, underpinned by the Delta variant, and the corresponding lockdowns across various Australian states in August continued to dampen demand and output,\" IHS Markit said.\nJapan is also experiencing worsening business conditions, with companies reporting dwindling optimism following a recent surge in Covid-19 cases.\nOngoing supply chain issues are part of the problem, stoking fears ahead of the important holiday shopping period.\nCoronavirus is a factor here, too; the latest obstacle is in China, where a terminal at the Ningbo-Zhoushan Port has been shut since Aug. 11 after a dock worker tested positive for Covid-19. Major international shipping lines have adjusted schedules to avoid the port and are warning customers of delays.\n\"The pressures on global supply chains have not eased, and we do not expect them to any time soon,\" Bob Biesterfeld, CEO of logistics firm C.H. Robinson, told my CNN Business colleague Hanna Ziady.\nIn the United Kingdom, private sector output is still growing, but the recovery appears to be sharply losing momentum.\n\"Despite Covid-19 containment measures easing to the lowest since the pandemic began, rising virus case numbers are deterring many forms of spending, notably by consumers,\" said Chris Williamson, chief business economist at IHS Markit.\nIn addition to supply chain concerns, businesses also pointed to staff shortages as a major headwind.\nHolding up better: Supply chain woes are also affecting Europe, which logged a slight decline in its Purchasing Managers' Index.\nBut business output among the 19 countries that use the euro \"continued to grow at one of the strongest rates seen over the past two decades in August,\" according to IHS Markit.\n\"Although the spread of the Delta variant caused widespread problems across the region, curbing demand and causing further supply issues, firms benefited from virus containment measures easing to the lowest since the pandemic began,\" Williamson said.\nOn the radar: Which camp will the United States fall in? We'll find out when IHS Markit's data for the country posts later Monday.\nThe Back-to-Normal Index from CNN Business and Moody's Analytics indicates that the US economy is operating at 92% of its pre-pandemic level. But expectations for third quarter economic growth are softening thanks to Delta's effect on spending.\nBitcoin passes $50,000 for the first time since May\nBitcoin has surged above the $50,000 mark as the digital currency continues to climb out of a months-long slump, my CNN Business colleague Diksha Madhok reports.\nBitcoin's price rises above $50,000 for the first time since May\nIt's the first time bitcoin has reached that milestone since May 15. Bitcoin's peers also advanced. Ethereum was up more than 3%, while dogecoin rose nearly 2%.\nBitcoin had been inching near $50,000 all weekend before finally crossing the threshold Sunday evening, according to data from CoinDesk.\nDriving the gains: The cryptocurrency is getting a lift after PayPal announced that it will allow people to buy, hold and sell four types of cryptocurrencies — bitcoin, ethereum, litecoin and bitcoin cash — in the United Kingdom.\nThis announcement marks the first international expansion of the company's cryptocurrency offering outside of the United States, where it launched the service in October last year.\nRemember: It's been a turbulent few months for cryptocurrencies. Bitcoin, which hit an all-time high of nearly $65,000 in April, plummeted as low as $28,800 in June after China escalated its crackdown on digital currencies.\nBitcoin, which had been hovering between $30,000 and $40,000 for many weeks, began to break out of its slump earlier this summer. One catalyst has been Amazon, rumored to be considered an entrance into the crypto market after posting a job opening for a digital currency and blockchain product lead.\nWhat forced changes at OnlyFans?\nLast week's decision by the creator platform OnlyFans to soon stop hosting a wide swath of sexually explicit content has sent shockwaves through the internet.\nOnlyFans, a website with 130 million users and more than 2 million content creators, has become synonymous with pornography. For many, performing on the app is a lifeline: Some who lost their jobs during the pandemic turned to sharing explicit videos of themselves on OnlyFans to help pay the bills. Many of these sex workers are now expressing outrage at what they view as OnlyFans' betrayal of a community that enabled the platform's massive success.\nOne explanation: Venture capital firms are often wary of investing in platforms that host adult content. According to internal documents obtained by Axios, OnlyFans' popularity and revenue both exploded during the pandemic, yet it has struggled to secure outside investment.\nThe pivot at OnlyFans is also tied to a much wider crackdown by payment processors who handle credit card swipes behind the scenes, my CNN Business colleague Brian Fung reports.\nOnlyFans said its decision was driven with a view toward building a sustainable platform for the long term. \"These changes are to comply with the requests of our banking partners and payout providers,\" the company said.\nSeth Eisen, a spokesman for Mastercard (MA), told CNN Business it was not involved in OnlyFans' decision to restrict the content it would allow on the platform. \"It's a decision they came to themselves,\" Eisen said.\nUp next\nJD.com (JD) and MSG Entertainment (MSG) report earnings before US markets open.\nAlso today →\nThe IHS Markit Purchasing Managers' Index for the United States posts at 9:45 a.m. ET.\nExisting US home sales for July arrive at 10 a.m. ET.\nComing tomorrow: Best Buy (BBY), Nordstrom (JWN) and Urban Outfitters (URBN) earnings.\n"}