{"title":"Stocks are dropping. They could stay bumpy","date":"2021-08-19","classification":"good","text":"Title: Stocks are dropping. They could stay bumpy\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)After notching a string of record highs, US stocks are stuttering.\nWhat's happening: The Dow and S&P 500 both closed 1.1% lower on Wednesday after minutes from the most recent meeting of the Federal Reserve indicated that the central bank could announce plans to cut back on bond purchases in the near term.\nIt was the second straight session of sharp losses — and US stocks are lower again in premarket trading Thursday. Global oil prices also fell, while the US dollar strengthened.\n\"Absent a significant reversal in the strong jobs numbers or inflation data, the minutes reflect a Fed that is prepared to accelerate its taper timeline to perhaps the next few months,\" said Sean Bandazian, an investment analyst for Cornerstone Wealth.\nBreaking it down: For months, investors have been bracing for the Fed to announce that it's going to start reversing unprecedented support for the economy launched in the early stages of the pandemic.\nIn a survey of global fund managers by Bank of America published this week, 84% of respondents said they expected the Fed to say it will slow bond purchases by the end of the year. As many as 28% of investors predicted the Fed would signal this at its annual conference in Jackson Hole next week.\nThe suspicions of some were confirmed Wednesday. The Fed's meeting minutes included this disclosure: \"Various participants commented that economic and financial conditions would likely warrant a reduction in coming months.\"\nWhy it matters: Rock-bottom interest rates and $120 billion in securities purchases per month have been a boon for stocks. There are fears that when the Fed finally does turn off the money taps, that will trigger a so-called \"taper tantrum.\"\nPlus, talk of changes comes amid uncertainty surrounding the Delta variant of the coronavirus, which is undermining confidence in the trajectory of the US economy.\nNot so fast: Some of the turbulence may be seasonal. \"The tapering discussion in [the July] Fed minutes was hardly a surprise, but US equities responded negatively anyway because we're in a typical low volume/higher volatility August period,\" Nicholas Colas, cofounder of DataTrek Research, said in a research note Thursday.\nBut September, historically the worst month for stocks, is looming. As the Fed begins to change course, more volatility could arrive this fall.\nAfghanistan's currency crumbles to record lows\nAfghanistan's currency has tumbled to record lows since the Taliban seized control of the country and a shortage of US dollars set off a panic.\nAfghanistan's currency crumbles to record lows\nThe afghani traded at 86 per US dollar on Wednesday, down sharply from about 80 a week ago, according to data from Refinitiv, my CNN Business colleague Matt Egan reports.\nStep back: The plunge reflects concerns about the future of Afghanistan after the capital of Kabul fell into the hands of the Taliban, a repressive militant group sanctioned by the United States and other world powers.\nAfghanistan's fragile economy relies heavily on US-led international aid — a lifeline that is now in severe doubt as the US military withdraws its troops. About 75% of public spending is financed through international aid grants, according to the World Bank.\nRobert Kahn, director of global strategy at the Eurasia Group, said fears are growing about a shortage of physical US dollars, on which the Afghan financial system is heavily reliant because its economy imports more than it exports.\nThe International Monetary Fund is scheduled to send about $450 million to Afghanistan next week. But that money could be cut off.\nBig picture: The decline in Afghanistan's currency will add pressure to inflation. Rising prices, especially for food and necessities, will hit the nation's poorest the hardest at a time of major instability.\nRobinhood's first post-IPO earnings disappoint\nRobinhood's sales more than doubled last quarter, led by strong demand for cryptocurrency trading. But that's not what's catching investors' attention from the company's latest earnings report.\nThe latest: The trading platform reported a net loss of $502 million, my CNN Business colleague Paul R. La Monica reports. That was much bigger than Wall Street's forecasts.\nShares are down more than 9% in premarket trading.\nIt wasn't all bad news for Robinhood, which has gotten a huge boost from the crypto craze.\nThe company said last quarter was the first time more new customers made their first trade in cryptos, such as bitcoin and ethereum, instead of stocks. More than 60% of cryptocurrency trading volume in the second quarter was in dogecoin, the meme currency that has gotten a bump thanks to tweets by Tesla and SpaceX CEO Elon Musk.\nBut whether the startup can consistently make money remains top of mind. In 2020, the company managed to squeeze out a profit of $7 million. Yet criticism in Washington of the core business model that allows Robinhood to offer commission-free trades has been growing — raising concerns among investors about whether it can keep offering this feature long-term.\nUp next\nKohl's (KSS), Macy's (M), Petco and Tapestry (TPR) report results before US markets open. Ross Stores (ROST) follows after the close.\nAlso today: Initial US jobless claims for last week arrive at 8:30 a.m. ET.\nComing tomorrow: Earnings from Deere (DE) and Foot Locker (FL).\n"}