{"title":"Markets are climbing a wall of worry from Evergrande to Delta and inflation","date":"2021-09-21","classification":"bad","text":"Title: Markets are climbing a wall of worry from Evergrande to Delta and inflation\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)Global markets are rebounding from a sharp selloff on Monday, when the S&P 500 and the Nasdaq Composite logged their worst performances since May.\nBut to keep advancing, stocks will need to surmount a lengthening list of anxieties simmering under the surface that threaten to curtail the year's spectacular run.\n\"We've been in the camp that we're overdue for a correction, something in the 5-10% range that is a buyable pullback,\" said Cliff Hodge, chief investment officer at Cornerstone Wealth.\nThis may not be the week. Bespoke Investment Group has highlighted the prevalence of \"turnaround Tuesdays,\" observing that after Monday losses of 1.5% or more, the following trading session has \"much more frequently led to gains of more than 1% than losses of more than 1%.\"\nStill, investors are keeping a watchlist of concerns. The CNN Business Fear & Greed Index was last showing a reading of \"extreme fear.\"\nEvergrande: Attention on Monday focused on Evergrande, the Chinese conglomerate battling a debt crisis. Should the company default on its massive liabilities, there are fears it could spark a \"Lehman moment,\" in which the collapse of a single entity ricochets throughout the financial system.\nThere are plenty of market analysts pushing back on that narrative. They argue that the fallout is likely to remain contained, especially if Beijing steps in to cushion the blow. But with interest payments totaling more than $100 million due Thursday on two of the company's bonds, all eyes are on what happens next.\nGrowth: The Evergrande saga could weigh on China's property sector, a key engine of growth, at a time when the world's second largest economy is already stalling.\nIn the United States, meanwhile, the Delta variant of the coronavirus is hurting the recovery, despite some signs of resilience in recent data. The Back-to-Normal Index created by CNN Business and Moody's Analytics fell back to 89% as of Sept. 17 as Americans cut back on travel and dining out.\nInflation: The Organization for Economic Cooperation and Development upgraded its inflation forecast for 2021 and 2022 on Tuesday. It now predicts that consumer inflation across G20 countries will sit at 4.5% at the end of this year before easing slightly to 3.5% by the end of next year — still much higher than the long-term trend.\nSupply chain problems are adding to upward pressure on prices. On Monday, FedEx (FDX) announced that it will increase its shipping rates in the new year, citing \"incremental costs associated with the challenging operating environment.\" Businesses could pass these higher expenses along to consumers. Surging natural gas prices could also hit pocketbooks.\n\"Supply pressures should fade gradually, wage growth remains moderate and inflation expectations are still anchored, but near-term risks are on the upside,\" the OECD said in its report.\nDebt debate: The United States is in a race against the clock to raise its debt ceiling, and a showdown in Congress looks imminent.\nAnalysts at BlackRock (BLK) told clients this week that they see a \"low risk of technical default and limited chance of a temporary government shutdown.\" Yet they still think \"the twists and turns could trigger jitters in markets that have had an extended run higher.\"\nThe Fed: The most immediate concern is the upcoming policy announcement from the Federal Reserve on Wednesday.\nThe meeting is expected to be a crucial indicator of how quickly the central bank plans to pull back crisis-era support for the economy. Consensus is growing that the Fed will hold off until November before announcing a taper that kicks in by year-end. Tomorrow's meeting will also include the publication of the Fed's latest economic projections, and its \"dot plot,\" which signals when individual members expect interest rate hikes to take effect.\nUniversal Music shares jump in Amsterdam debut\nMusic streaming is booming, and investors desperately want a piece of the action.\nThe latest: Shares of Universal Music Group, which were spun off by French media conglomerate Vivendi, were last up 35% in their market debut in Amsterdam on Tuesday.\nThe world's biggest label, which is now valued at roughly $53 billion, is home to stars including Ariana Grande, Taylor Swift, Justin Bieber and Billie Eilish, and also controls the back catalogues of music greats like Marvin Gaye, The Rolling Stones and Frank Sinatra.\nFollowing the listing, Vivendi holds a 10% stake in the company. A consortium led by China's Tencent controls another 20%, while billionaire Bill Ackman's Pershing Square also owns 10%.\nStep back: Subscription music services have become hugely important to UMG, which has bet that streaming will help offset declines in physical sales.\nIn 2020, UMG generated €3.8 billion ($4.5 billion) of revenue from subscription music services and ad-supported streaming. That's a big chunk of the €7.4 billion ($8.7 billion) it brought in overall.\nAnalysts at UBS have called UMG a \"unique low risk high growth asset\" for those looking to cash in on the streaming moment. The bank pointed out in a recent note to clients that the label not only has \"an irreplaceable deep catalogue,\" but also represents the industry's top current talent.\nGlobal market angst sends bitcoin lower\nPressure on global markets never seems to be good news for cryptocurrencies. This time has been no exception.\nBitcoin dropped as low as $40,267 in the last 24 hours before pushing back above $43,000, according to data from Coindesk. It's still off almost 4% during that period.\nEvergrande \"is putting a tremendous dent in risk appetite that is sending everything lower,\" Oanda senior market analyst Edward Moya told clients.\nHe added that cryptocurrencies have performed well this year \"despite all the volatility.\" That means \"it should not surprise Wall Street they are the first asset sold in the beginning of China-driven market selloff\" as investors take some cash off the table.\nWatch this space: Not everyone is banking profits, however. Nayib Bukele, the president of El Salvador — which recently became the world's first country to adopt the bitcoin as legal tender — said Monday that the country purchased 150 additional bitcoins, bringing its total holdings to 700 coins.\n\"They can never beat you if you buy the dips,\" he tweeted.\nUp next\nAutoZone (AZO) reports results before US markets open. Adobe (ADBE), FedEx and Stitch Fix (SFIX) follow after the close.\nAlso today: US housing starts and building permits for August post at 8:30 a.m. ET.\nComing tomorrow: The latest policy decision from the Federal Reserve.\n"}