{"title":"5 things to know for September 21: Immigration, Covid, Canada, Congress, Evergrande","date":"2021-09-21","classification":"bad","text":"Title: 5 things to know for September 21: Immigration, Covid, Canada, Congress, Evergrande\nGet '5 Things' in your inbox\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN)President Biden is due to speak today before the UN General Assembly. It's one of the biggest moments in the spotlight for any head of state, and Biden will try to rally allies to address emerging global challenges -- and leave old conflicts behind.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here.)\n1. Immigration\nThe White House says it's seeking more information about video that appears to show mounted US Border Patrol agents aggressively confronting Haitian migrants at the southern US border. About 10,000 people, many of them Haitian refugees, are still crowded near the Del Rio International Bridge in Texas after the Department of Homeland Security moved some 3,000 people to other processing facilities yesterday. Homeland Security Secretary Alejandro Mayorkas said his agency is facilitating one to three deportation flights to Haiti and other locations daily. Only refugees from Haiti who arrived in the US before July 29 are eligible for temporary protected status, he said. Many Haitians now at the border are believed to have been living in South America after the 2010 earthquake in Haiti, but the toll of the pandemic on the region fueled migration to the US border.\nVideo shows Border Patrol agent giving migrant medical aid 01:25\n2. Coronavirus\nPfizer and BioNTech announced that their lower-dose Covid-19 vaccine was found to be safe and generated a \"robust\" antibody response in children ages 5 to 11. But before those children can become eligible for the vaccine, four things must happen. First, Pfizer needs to request FDA authorization for this new age group. Then, the FDA would need to amend the vaccine's emergency use authorization to include younger people. After that, the CDC would have to weigh in. Finally, rollout logistics would need to be addressed, including how to tackle vaccine hesitancy among parents. Meanwhile, the US has crossed another dark threshold: At least 675,000 people have now died of Covid-19, which is more than the US death toll from the 1918 flu pandemic. \nDr. Wen reacts to results of Pfizer children's vaccine trials 01:13\n3. Canada\nThe results of Canada's snap general election are in. Prime Minister Justin Trudeau has prevailed over conservative rival Erin O'Toole, meaning his Liberal Party will form Canada's next government. However, Trudeau's side fell short of winning the 170 seats needed to form a majority government. The Liberals won 157 seats to the Conservatives' 122. The election highlighted polarizing issues in Canada and mobilized a small but vocal sector that's angry over Trudeau's Covid-19 protocols. Trudeau told supporters the outcome means \"millions of Canadians have chosen a progressive plan.\"\nHear what Trudeau and his rival said after results came in 01:54\n4. Congress\nCongressional Democratic leaders have announced they will attach a suspension of the debt limit to a must-pass spending bill to keep the government funded. That way, Republicans are forced to choose between addressing the debt limit -- something many have said they don't want to do -- and risking a government shutdown. The House is expected to vote today on the spending bill, known as a continuing resolution. The vote will be an early litmus test to see if Republicans are willing to vote to shut down the government. Already, Democrats have changed their goals on the matter. Last week, House Majority Leader Steny Hoyer said the House would move to suspend -- rather than raise -- the debt limit. \nClyburn backs raising debt limit with Dem votes only if necessary 01:50\n5. Evergrande\nEvergrande, one of China's largest real estate developers and one of the biggest businesses in the world, is causing a major crunch for the global economy. The massive business has massive debts -- about $300 billion worth -- and was due to pay off the interest on some of its bank loans yesterday. As the company remains in danger of defaulting, the US stock market and other global markets have taken a tumble. Cryptocurrencies like Bitcoin and Ethereum have fallen, too. The Chinese government could intervene to limit the fallout if Evergrande were to default, but investors are still extremely nervous about how such huge amounts of borrowing could affect market stability. Some are likening a possible crash to the 2008 collapse of Lehman Brothers, which was a nadir of the credit crisis at the time. \nChinese property giant Evergrande is on the brink of default 02:49\nBREAKFAST BROWSE\nPrices are soaring for Christmas trees and decorations\nIt's beginning to look a lot like a very expensive Christmas. \nThis is why your next car, cheese party or refrigerator could be in peril 02:00\nElizabeth Olsen's Emmy dress was designed by her sisters\nTell us your family is talented without actually telling us your family is talented. \nPrincess Beatrice, granddaughter of Queen Elizabeth II, gives birth to her first child\nOh, to be a guest at that baby shower. \nBritain's Princess Beatrice announces engagement (2019) 00:52\nFedEx is raising its shipping rates next year\nBut, yes, some rates could also increase before the (even more expensive!) holiday season. \nBoeing is reportedly investigating empty tequila bottles found on a future Air Force One\nPlane-building: one of the worst times ever to be drinking on the job\nTODAY'S NUMBER\n$586,000\nThat's how much Poland has to pay per day to continue operating a controversial coal mine near its Czech and German borders, the European Court of Justice ruled. Poland's neighbors have campaigned to have the Turów lignite mine shut over environmental concerns.\nPoland's coal dependency hampers climate change efforts 03:39\nTODAY'S WEATHER\nMore rain for a water soaked South 01:42\nCheck your local forecast here>>>\nAND FINALLY\nYaaaaaaawn\nA little tired this morning? So is this giant salamander. (Click here to view.)\n"}