{"title":"Stocks tumble as Wall Street's fears turn to China","date":"2021-09-20","classification":"bad","text":"Title: Stocks tumble as Wall Street's fears turn to China\nNew York (CNN Business)The Dow and the broader US stock market fell to close sharply lower Monday as Chinese real estate conglomerate Evergrande's debt crisis made American investors uneasy.\nIt was the worst performance since May for the S&P and the Nasdaq, while the Dow logged its worst day since July.\nStocks spent the whole day deep in the red and the Dow fell more than 970 points at its low point.\nThe market recovered slightly before the closing bell rang, but it was still an awful session: The Dow (INDU) finished down 1.8%, or 614 points. The S&P 500 (SPX), the broadest measure of Wall Street, closed down 1.7%, while the Nasdaq Composite (COMP) fell 2.2%.\nBank and energy stocks fared worst, with Goldman Sachs (GS) and JPMorgan (JPM) among the Dow's worst performers.\nThe White House said it is monitoring the markets, but stressed that Evergrande's business was \"overwhelmingly centered in China.\"\nEvergrande, which is struggling to manage its $300 billion mountain of debt, was supposed to pay the interest on some of its bank loans Monday, according to Bloomberg. The company will also have to pay interest on two of its bonds worth more than $100 million later this week, according to Refinitiv.\nShares of Evergrande fell more than 10% in Hong Kong.\nWhy are global investors so worried about something that's happening in the Far East?\nEverything is connected in the world of financial markets and the massive amount of money borrowed by Chinese companies has long been considered a looming threat to market stability. Now investors fear the exposure that banks might have to Evergrande and companies like it.\nAdding a dash of melancholy, this crisis comes on the thirteenth anniversary of the collapse of Lehman Brothers.\nBut in spite of the timing, it's far from certain that Evergrande's crisis will become a similarly systemic event, according to Ryan Detrick, chief market strategist for LPL Financial.\nFor one, Evergrande has physical assets that could be sold to help settle its debts, Detrick said. He also expects a restructuring — rather than a default — of Evergrande's US dollar-denominated bonds.\n\"We think the odds do favor the Chinese communist government will get involved should there be a default,\" Detrick said. \"They are holding out as of now, but the fallout could be too great for them to avoid intervening.\"\nMeanwhile, it's not just worries about contagion that are pushing the market lower. US stocks struggled for direction last week and market analysts have long said a correction is needed after the long rally that pushed stocks up to record highs.\n\"On a down market day, it's easy to look to the nearest headline like Evergrande and attach a cause and effect, but this market has experienced almost no downside volatility for a long time and a pullback was long overdue,\" said David Bahnsen, chief investment officer at The Bahnsen Group, in a note to clients.\nStill the ripples were felt across the market. Bond yields fell as prices rose because investors fled to safety. Bitcoin, another risky asset class, also felt some pain and was down some 7% around the time of the close.\nIn the world of commodities, US oil prices settled more than 2% lower, while gold prices settled up 0.7%.\nCNN Business' Laura He and Jason Hoffman contributed to this story.\n"}