{"title":"Chevron's low-carbon push still puts it behind the curve","date":"2021-09-15","classification":"good","text":"Title: Chevron's low-carbon push still puts it behind the curve\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)Chevron (CVX), the $186 billion US oil giant, is taking steps to diversify its business away from fossil fuels as concerns about the climate crisis grow.\nWhat's happening: This week, the company announced that it will spend $10 billion through 2028 on low-carbon energy sources like renewable diesel fuel and hydrogen, more than triple prior guidance of $3 billion.\n\"We believe that these investments will advance a lower carbon future and be good for our shareholders,\" CEO Michael Wirth said on a call with analysts.\nThe company behind Tide and Bounty pledges net zero emissions by 2040\nSo far, Chevron's approach to the green transition has differed from its competitors. The company isn't focusing on solar and wind power, for example. Wirth said that the technology and markets for these energy sources is already \"relatively mature.\" Instead, it's investing in products like sustainable fuels that will be essential to helping the transportation sector go green.\n\"These business lines are earlier in life than renewable power, have value chains that will often connect with our traditional ones and are areas where we believe we can earn double-digit returns,\" Wirth said.\nInvestors aren't sure about the strategy. Shares fell 1.8% on Tuesday, though they're still up almost 14% this year thanks to a strong rebound in energy prices.\nBreaking it down: The problem may be that oil and gas companies like Chevron are trying to make changes to their business in an environment where there's little consensus about what the future looks like for the industry.\n\"You can ask 10 investors what oil companies should do and get 10 different answers,\" RBC Capital Markets analyst Biraj Borkhataria told me. \"There doesn't appear to be a sweet spot, as far as I can tell.\"\nChevron — which is still primarily an oil and gas operation — is hesitant to rock the boat, seeing a future for fossil fuels even as the world races to cut carbon emissions.\nThe $10 billion commitment amounts to just under 10% of Chevron's annual capital spending based on its medium-term guidance, Borkhataria said.\nBut this pace could ultimately leave Chevron behind. Doug Leggate at Bank of America emphasized to clients that Chevron's \"green scale is well below [European] peers.\"\n\"It is navigating a fine line that increases green investments but at a scale that does not materially impact a fundamental strategy,\" he wrote.\nThis raises the risk that investors will get impatient. Chevron notably did not release longer-term net zero targets like those announced by BP (BP) and Shell (RDSA), though an update could be coming later this year.\nWatch this space: At Chevron's annual meeting in May, almost 61% of shareholders voted in support of a proposal pushing the company to slash greenhouse gas emissions tied to use of its energy products.\nMeasuring change at energy firms might be getting easier. On Wednesday, investors representing $10.4 trillion in assets published a blueprint detailing how companies should approach net zero plans, called the \"Net Zero Standard for Oil and Gas.\"\n\"This net zero standard is intended to support investors in understanding the credibility of companies' commitments and transition plans so that they can engage effectively with the sector, especially those companies that are lagging behind,\" Stephanie Pfeifer, chief executive of the Institutional Investors Group on Climate Change, said in a statement.\nRemember: Oil companies are taking steps to signal that they're taking efforts to rein in emissions seriously. But the International Energy Agency has warned that in order to reach 2050 net zero targets, all new oil and gas development needs to cease immediately — a fact no amount of spending on biofuel will change.\nUS inflation took a breather in August. Prices are still high\nInflation, a top concern among economists and investors monitoring the US recovery, eased slightly in August, though price increases remain uncomfortably high compared to the pre-pandemic era.\nThe latest: Consumer prices rose 5.3% in the year ended in August, a tad below the 5.4% increase in June and July, the Bureau of Labor Statistics said Tuesday. Stripping out more volatile items like food and energy, prices rose by 4%, also a smaller increase than in July, my CNN Business colleague Anneken Tappe reports.\nUS inflation eased in August. But America's not out of the woods yet\nCompared to July, consumer prices rose 0.3%. It was the second straight month in which the inflation rate fell slightly.\nBreaking it down: The data could solidify the Federal Reserve's view that inflation is transitory and won't be too disruptive to the economy.\nThe data \"[reaffirms] our core view that inflation has likely formed a peak in summer 2021 following the historic supply shock that defined pandemic economics during 2020-21,\" RSM economist Joseph Brusuelas said in a note to clients.\nMore details: The surge in Covid-19 infections caused by the Delta variant appears to be having an impact. Prices for airline tickets fell by 9.1% during the month. Car rental costs also dropped significantly.\nBut other goods are still getting more expensive. New car prices and household furnishings rose month-over-month.\nBottom line: It's too early to definitively indicate where inflation goes next, especially given the unpredictability of the virus. And elsewhere, signs are less promising, with UK inflation jumping at the fastest rate in at least 24 years in August.\nBig names are ramping up crypto investments\nFor cryptocurrency backers, it's been a gut-wrenching year, as bitcoin, ether and other digital coins skyrocketed to record highs only to suddenly plunge in the spring. But as digital currencies show signs of resilience, some major players have decided they're ready to start investing in the space.\nSee here: Radkl, a digital asset investment and trading firm, went live Tuesday with backing from Steve Cohen.\nThe hedge fund billionaire and owner of the New York Mets has recently been upping his exposure to the crypto sector. In August, Messari, a crypto intelligence startup, said its $21 million Series A funding round was led by Cohen's Point72 Ventures. Cohen has also invested in Recur, a tech company that focuses on non-fungible tokens, or NFTs.\nAn initial skeptic, Cohen said Tuesday that he was swayed by his son, a \"cryptomaniac,\" Bloomberg reports.\n\"He really convinced me this was something I needed to do,\" Cohen said at the SALT conference.\nNot alone: Kevin O'Leary, the \"Shark Tank\" investor, told CNBC on Monday that he also plans to invest more in cryptocurrencies.\n\"I want to raise my exposure to crypto — currently at 3% — to 7% by the end of the year,\" O'Leary said, while urging US regulators to clarify their rules. \"I don't want to get involved in crypto if the regulator says it's not okay.\"\nUp next\nUS industrial production data arrives at 9:15 a.m. ET, followed by the latest on US crude oil inventories at 10:30 a.m. ET.\nComing tomorrow: US retail sales for August.\n"}