{"title":"Posing as Walmart, scammers send crypto surging 25%","date":"2021-09-13","classification":"bad","text":"Title: Posing as Walmart, scammers send crypto surging 25%\nNew York (CNN Business)In what appears to be a massively successful pump and dump scheme, cryptocurrency litecoin surged around 25% early Monday after a falsified news release said Walmart would begin accepting the payment for online purchases.\nInvestors had plenty of reason to believe the news was true: A verified litecoin Twitter account tweeted out a link to the announcement, which had appeared on the press release service GlobeNewswire. The press release looked legitimate enough, including (made-up) quotes from Walmart CEO Doug McMillon. Walmart had just posted a job for a cryptocurrency expert to work at its corporate headquarters. And several major news organizations picked up the news.\nThe announcement, however, was fake, a Walmart (WMT) spokesperson confirmed. Walmart is not accepting litecoin, and litecoin deleted its tweet. An hour after the announcement came out, Litecoin's price fell from more than $220 back to $178 --— around where it was trading before the false release went out.\nYes, the IRS can tax bitcoin and other cryptocurrencies. What you need to know\nIt's not yet clear who the scammers are, but the scheme is likely a pump and dump. That's when people buy an asset and drive up the price — typically with fake news — only to sell it once the price starts soaring.\nGlobeNewswire removed the press release minutes after CNN reached out, and it issued a correction, urging investors and the media to ignore the announcement.\nA spokesperson for Intrado, the service's parent company, said in an email that a \"fraudulent user account\" was created to issue the fake release. The service has stepped up its authentication measures and pledged a full investigation into how its systems were tripped.\nAlthough the press release appeared authentic at first glance, it contained some telltale signs of fake news. It contained the bogus \"walmart-corp.com\" website as the email address for Walmart's chief marketing officer. It used an partial title for McMillon. And it was the first and only press release Walmart had issued on GlobeNewswire.\nLitecoin was also an odd choice for Walmart. Although it's among the oldest cryptocurrencies on the market, it's outside the top 10 of the largest digital coins, and it's typically not among the most actively traded -— although that changed Monday when several billions of dollars of litecoin changed hands, according to online trading platform Coinbase.\nPump and dump schemes are typically reserved for less-regulated markets, such as penny stocks and cryptocurrencies, where regulators and investors have less insight into the markets and less ability to to suss out criminal activity. Although unusual, the falsified press release of a company the size of Walmart was not the first of its kind.\nIt's been a turbulent few months for cryptocurrencies, which have grown in recent years. Bitcoin, which hit an all-time high of nearly $65,000 in April, plummeted as low as $28,800 in June after China escalated its crackdown on digital currencies. It's now around $44,000.\nRegulatory concerns have also increased around digital currencies. The Senate added a provision to its $1.2 trillion infrastructure bill passed last month that impose more federal regulation on cryptocurrencies and could expand the number of cryptocurrency users who would have to report filings to the Internal Revenue Service. The bill now must be approved by the House before it can head to President Joe Biden's desk.\n"}