{"title":"5 things to know for September 9: Coronavirus, Afghanistan, Ida, China, California","date":"2021-09-09","classification":"bad","text":"Title: 5 things to know for September 9: Coronavirus, Afghanistan, Ida, China, California\nGet '5 Things' in your inbox\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN)A dog named Baekgu, credited with saving his 90-year-old owner, has been appointed as South Korea's first honorary rescue dog.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here.)\n1. Coronavirus\nPresident Biden is expected today to unveil a plan that will push for new vaccine mandates and testing programs as part of a revamped approach to ending the pandemic. The administration's six-pronged plan will focus on vaccinating the unvaccinated, further protecting the vaccinated through booster shots, keeping schools open, increasing testing and requiring masks, economic recovery and improving care for those with Covid-19, a source told CNN. Meantime, data revealed that the risk of severe breakthrough Covid-19 cases is higher for older adults and for those with multiple underlying medical conditions. And as doctors feared, it is children who are getting hit hard by Covid-19 as school restarts. \"This virus is really going for the people who are not vaccinated,\" said Dr. Edith Bracho-Sanchez, associate professor of pediatrics at Columbia University Irving Medical Center. \"And among those people are children who don't qualify for the vaccine.\" A record 2,396 children were hospitalized with Covid-19 as of Tuesday, according to official data.\nDad threatened by anti-mask crowd says son has Covid-19 03:37\n2. Afghanistan \nTaliban fighters used whips and sticks against women protesting in Kabul following the announcement of a hard-line, male-only interim government, in the group's latest crackdown on dissent. Videos and images show women chanting, \"Long live the women of Afghanistan.\" Some held placards declaring, \"No government can deny the presence of women\" and \"I will sing freedom over and over.\" Others held placards with the image of a pregnant police officer who was killed in Ghor province a few days ago. The Taliban told CNN they were not involved in her death but have launched an investigation. Meanwhile, China will provide almost $31 million worth of food, winter weather supplies, vaccines and medicine to Taliban-controlled Afghanistan. China also will donate an initial 3 million coronavirus vaccine doses to Afghanistan, state media reported.\nResistance official: Afghans are answering the call for an uprising 04:09\n3. Ida\nNew Orleans has lifted the curfew imposed after Hurricane Ida as electricity has been restored to most of the city. Across Louisiana, however, more than 240,000 customers are still in the dark. To help with recovery efforts, the Carnival Glory cruise ship announced it has an agreement with New Orleans and FEMA to house hospital staff, first responders and other emergency workers. Additionally, Louisiana's health department has revoked the licenses of seven nursing homes that sent residents to a warehouse to shelter -- a situation the department said involved unsafe and unsanitary conditions. Seven of the residents died. And here's a closer look at why Ida's remnants were so deadly for the Northeast.\nIda: 7 nursing home licenses suspended 03:12\n4. China\nA US destroyer sailed yesterday near the Spratly Islands in the South China Sea, the US Navy's 7th Fleet announced, days after China imposed new maritime identification rules that include the disputed waterway. The USS Benfold, an Arleigh Burke-class destroyer, sailed within 12 miles of Mischief Reef, a part of the Spratly Islands where the Chinese have built military facilities. China has accused the US of \"illegally\" entering its waters. \"The activity has seriously violated China's sovereignty and security,\" a statement read. The US 7th Fleet called the Chinese statement \"false.\" The 7th Fleet said it is the \"latest in a long string of (People's Republic of China) actions to misrepresent lawful US maritime operations and assert its excessive and illegitimate maritime claims.\" Tensions over the South China Sea come as a report reveals a pro-Chinese government online influence operation is targeting Americans in an effort to exploit divisions over the Covid-19 pandemic and \"physically mobilize protestors in the US in response.\"\nHarris hits back at China over South China Sea (August) 02:16\n5. California recall\nCalifornia Gov. Gavin Newsom has been doing everything he can to persuade women to vote \"no\" on the Republican effort to oust him in Tuesday's recall election, and Vice President Kamala Harris yesterday helped deliver that message. \"You have to understand that this recall campaign is about California, and it's about a whole lot more,\" Harris said, trying to nationalize the race by voicing her outrage over the conservative agenda, particularly Texas' new restrictive abortion law. Harris' involvement comes as Republican candidate Larry Elder told reporters he believes \"there might very well be shenanigans\" in the recall election, continuing the baseless GOP effort to undermine elections by suggesting wrongdoing. Though a lot is different about this year's recall in California, former Gov. Arnold Schwarzenegger described it as \"exactly the same\" as when he ran. And California's homelessness crisis is a top-of-mind issue for many voters.\nCA governor puts focus on unions ahead of recall vote 02:31\nBREAKFAST BROWSE\n2021 Macy's Thanksgiving Day Parade will be more like its old self \nIt will return to a more traditional route, with the public lining the streets of Manhattan to watch.\nRussian politician faces near-identical opponents in election\nA veteran politician has complained that two opponents in St. Petersburg have adopted his name and mimicked his appearance to confuse voters. \nThe 'world's best' cities for 2021? \nSan Francisco has been crowned the \"world's best\" city, according to Time Out.\nJennifer Aniston unveils new hair care brand, LolaVie\nThe first product by the \"Friends\" star's brand is a \"glossing detangler.\" \nEl Salvador's bitcoin experiment is a warning to other countries\nEl Salvador's \"Bitcoin Day\" did not go especially well.\nEl Salvador divided over making bitcoin legal tender 03:42\nHAPPENING LATER\nPro football is back\nThe NFL kicks off its 102nd season tonight, once again playing under the shadow of the Covid-19 pandemic. \"Our challenge is right now -- we are in a major surge,\" said NFL Chief Medical Officer Allen Sills. \"It is no secret ... what the impact of the Delta variant is having.\"\nNFL asks fans to play a key role in preventing Covid-19 outbreaks at stadiums 04:07\nTODAY'S NUMBER\n73\nThe number of years since the founding of North Korea. To mark the anniversary, the notoriously reclusive country held a midnight military parade in Pyongyang, state media reported. North Korean leader Kim Jong Un waved at the crowd, planes flew overhead firing flares and paratroopers dropped from aircraft in the night sky.\nNorth Korean parade features 'emergency disease prevention unit' 02:27\nTODAY'S QUOTE\n\"Cyber grave robbers did move very quickly after the collapse to grab what they could from deceased victims while families and friends were in absolute emotional turmoil.\"\nThree people have been arrested in South Florida and accused of identity theft of victims of the Surfside condo collapse, according to Miami-Dade State Attorney Katherine Fernandez Rundle. There were seven victims in this case, five of them deceased, the prosecutor said.\nHide Caption\n58 of 58\nPhotos: Deadly condo collapse near Miami\nExcavators dig through the remains from the Champlain Towers South building on July 9.\nHide Caption\n1 of 58\nTODAY'S WEATHER\nSoutheast getting drenched by Tropical Depression Mindy 01:30\nCheck your local forecast here>>>\nAND FINALLY\nRonaldo is back training with Manchester United\nAfter a shock return to his old club, one of the world's greatest soccer players gets back on the field in a surprisingly sunny Carrington. (Who needs Turin?!) (Click here to view.) \n"}