{"title":"Bitcoin prices top $50,000 for the first time in four weeks","date":"2021-10-05","classification":"good","text":"Title: Bitcoin prices top $50,000 for the first time in four weeks\nNew York (CNN Business)The whirlwind ride for bitcoin continues. The price of the world's most valuable cryptocurrency soared above $50,000 Tuesday morning — the highest level in nearly four weeks.\nAlthough there was no specific catalyst driving bitcoin's recent surge, digital asset investment firm CoinShares notes investors have been plowing money into cryptocurrencies for the past seven weeks.\n\"We believe this decisive turnaround in sentiment is due to growing confidence in the asset class amongst investors,\" CoinShares said in a report Monday.\nThat increased confidence has pushed bitcoin to rally almost 20% in the past week. Other top cryptocurrencies, including ethereum, binance, solana and Elon Musk favorite dogecoin, have enjoyed similarly large gains.\nWill cryptocurrency replace the dollar? Scott Galloway explains 03:15\nAnother expert pointed out that some of the recent macro concerns that have dragged down stocks could also be boosting bitcoin.\n\"Inflation fears are driving a resurgence in crypto, and I don't think that's going away anytime soon,\" said Chris Kline, chief operating officer and co-founder of Bitcoin IRA.\nIt's been a stunning comeback for bitcoin and other digital currencies in the past few months.\nPrices had plunged in the late spring and summer on worries about a Chinese crackdown on cryptocurrencies and concerns that the United States might follow suit with stricter regulations.\nBut those US-centric fears have ebbed after Federal Reserve chairman Jerome Powell recently said that the central bank has no plans to be as tough on bitcoin as China has been.\nMainstreaming and the institutional investor factor\nMeanwhile, big US institutional investors are likely to increase their demand as bitcoin and other cryptos go mainstream, Naeem Aslam, chief market analyst with AvaTrade, said in a report Tuesday.\nCrypto 101\nBut he added that some top firms may be \"waiting for the price to drop a little more before they hit big buy orders\" following the recent surge.\nDespite increased adoption of bitcoin by consumers and the endorsement of cryptocurrencies by several top Wall Street firms and other financial giants, some skeptics remain.\nJPMorgan Chase (JPM) CEO Jamie Dimon, who has long been a vocal critic of bitcoin even as it has continued to rally, bashed it again a few days ago in an appearance on the Axios show on HBO.\nDimon said the cryptocurrency, which now has a market value of about $950 billion, is \"a little bit of fool's gold,\" adding that \"it's got no intrinsic value. And regulators are going to regulate the hell out of it.\"\n"}