{"title":"Most cryptos will fail, but bitcoin could be here for good","date":"2021-09-30","classification":"good","text":"Title: Most cryptos will fail, but bitcoin could be here for good\nNew York (CNN)Bitcoin is among the most polarizing investments in history. Ask a skeptic, and they'll tell you it's a bubble that's about to pop. Ask a believer, and they'll tell you it's a bubble that will keep expanding forever.\nMike Novogratz, founder and CEO of crypto fund Galaxy Digital, is among the world's biggest believers in the potential for cryptocurrencies. At a CNN Business' Foreseeable Future live event Thursday, he encouraged investors to look past the often massive daily swings that bitcoin takes and look at the bigger picture.\n\"Bubbles and manias happen around things that fundamentally change the way we think,\" Novogratz told CNN's Julia Chatterley during the event. \"Finance will be disrupted by decentralized systems, I'm confident of that.\"\nBitcoin is up about 45% this year and nearly 300% over the past 12 months, according to CoinDesk.\nMuch of the focus on bitcoin craze is about the underlying technology, Novogratz noted — but he thinks the crypto space represents a new investor identity beyond just looking for a return. Betting on bitcoin is about believing in a fundamental change to the way money works today.\nBitcoin traded just below $43,000 per coin Thursday. Novogratz expects it to be worth more than half a million per coin in ten years.\nBut while bitcoin is the biggest and most popular coin out there, there are thousands of others with much smaller market caps and likely perhaps staying power.\n\"I would bet 75% of cryptos don't make it\" through the next decade, Novogratz added.\nRegulatory reckoning coming?\nThough the digital currency space is filled with hungry investors and plenty of opportunity to put money to work, one dark cloud keeps hanging over it: regulation.\nIt's still not clear which regulatory entity is meant to oversee the crypto market — in part because it's not clear whether the cryptocurrency is a security or a currency.\nSome regulation would be useful, Novogratz said, but he expressed the importance of some freedom to innovate.\n\"We're all for regulation in the space,\" said Tavonia Evans, who founded the crypto Guapcoin to amplify the economic voice of the Black community. That's why she has been reaching out to regulators to work together on rules that make sense and don't stifle this new industry.\n"}