{"title":"The energy crunch is roiling markets","date":"2021-09-28","classification":"bad","text":"Title: The energy crunch is roiling markets\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)Energy prices are skyrocketing around the world, with major consequences for markets as investors worry about the state of the economic recovery.\nWhat's happening: Global markets are stumbling Tuesday as energy prices soar. One big problem has been shortages of natural gas, triggered by low stocks and a jump in demand as activity recovers from its Covid-19 lull.\nWholesale natural gas prices in Europe hit fresh records on Monday and continue to rally Tuesday, according to Tom Marzec-Manser at market intelligence firm ICIS. In the United States, natural gas futures have also jumped, surpassing levels last hit in 2014, when temperatures plunged across much of the country.\nChina is contending with a worsening energy situation, too, as it tries to reduce its reliance on coal just as demand for domestic-made goods is swelling. Companies in the country's industrial heartlands have been told to limit their energy consumption, according to state media, while supply has also been cut to some homes — reportedly trapping people in elevators.\nAsia is now \"scrambling\" to secure natural gas for immediate delivery \"in the same way Europe is,\" Marzec-Manser told me. And while the prices \"are nowhere near comparable\" in the United States, they're clearly on a steep upward trajectory, he added.\nThe circumstances put growing pressure on national governments, which are trying to limit instability by shielding residents from the effects of higher costs and shortages. For investors, the fallout presents another key risk.\nWatch this space: There were already concerns that the economic recovery was losing momentum in both the United States and China. Turmoil in energy markets only stands to make matters worse.\nAnalysts at Nomura trimmed their forecast for Chinese growth in 2021 by half a percentage point to 7.7% on Friday, citing the \"rising number of factories\" that have had to \"cease operations,\" either because of local energy consumption mandates or power outages due to rising coal prices and shortages.\nGoldman Sachs followed on Tuesday, cutting its 2021 GDP growth forecast to 7.8% from 8.2%, pointing to \"recent sharp cuts to production in a range of high-energy intensity industries.\"\n\"Short-term economic activity will likely experience a greater drag from this shock than from Evergrande,\" Craig Botham, chief China economist at Pantheon Macroeconomics, told clients Tuesday, referring to the debt-laden Chinese real estate developer whose potential collapse is being monitored closely.\nMarkets drop: Anxiety about rising energy prices is tied to broader fears about inflation, which have been pushing up bond yields. Higher yields, which move opposite prices, are encouraging investors to ditch high-growth tech stocks, which tend to perform better when bonds are more expensive.\nShares of Apple (AAPL), Microsoft (MSFT) and Amazon (AMZN) are all down roughly 1.5% in premarket trading.\nOil prices, meanwhile, are shooting up, with Brent crude futures, the global benchmark, hitting their highest level in almost three years. US oil futures are also at their highest since October 2018. If the winter is colder than expected, and securing natural gas remains difficult, there could be a scramble for crude, keeping prices elevated.\n\"Fuel oil may need to brace itself for the high gas and coal price situation bleeding into its own market,\" BloombergNEF analysts said in a report published Tuesday.\nFed officials step down after criticism over personal trades\nThe heads of the Boston and Dallas Federal Reserve banks have announced their early retirement amid a controversy over their personal investing decisions that raised conflict-of-interest concerns.\nThe latest: Eric Rosengren, the Boston Fed chief, cited his health Monday in announcing he would step down about a year earlier than planned, my CNN Business colleague Anneken Tappe reports. He was set to retire in June next year but moved that date up to Thursday. In a message to staff, he shared that he has a kidney condition and qualified for transplant, which will require making lifestyle changes.\nRegional Fed chiefs step down after criticism over personal trades\nLater Monday, Dallas Fed chief Robert Kaplan said in a statement that his retirement would take effect in early October. He attributed the move to recent scrutiny of his trading activity.\n\"The Federal Reserve is approaching a critical point in our economic recovery as it deliberates the future path of monetary policy,\" Kaplan said in a statement. \"Unfortunately, the recent focus on my financial disclosure risks becoming a distraction to the Federal Reserve's execution of that vital work.\"\nStep back: The Fed officials have faced backlash over trades made during the pandemic while the central bank was buying hundreds of billions of dollars in assets to shore up the economy. Stimulus from central banks has been a huge boon for financial markets.\nThe Boston Fed recently disclosed that Rosengren had investments in the real estate sector. At the same time, the central bank was buying $40 billion worth of mortgage-backed securities each month.\nMy thought bubble: It's important that the Fed is now reviewing its ethics rules, given how essential it is that the central bank, whose decisions steer the US economy, maintains public trust.\nThe shakeup could also have policy ramifications at a delicate moment. Rosengren and Kaplan were hawks, or officials who supported a faster rollback of pandemic-era support. The new Boston Fed president will be a voting member on the Fed's decision-making body next year, while the Dallas Fed president will hold a spot in 2023.\nThis hamster's crypto portfolio is beating the market\nMarket professionals don't like to be reminded that it's tough to consistently predict the whims of the market. Unfortunately for them, there's a hamster determined to drive home the message.\nSince June, a German hamster named Mr. Goxx has been running an independent portfolio that trades cryptocurrency from a high-tech cage called the Goxx Box. His portfolio includes a wide range of cryptocurrencies, including ether and bitcoin, my CNN Business colleague Ramishah Maruf reports.\nHow it works: Mr. Goxx's trading sessions are livestreamed on Twitch. First, the hamster runs on an \"intention wheel,\" which spins around and chooses a cryptocurrency. Then, it scampers through either a \"buy\" tunnel or a \"sell\" tunnel, triggering purchases or sales of roughly €20 ($23.35) worth of the cryptocurrency (presumably executed by the hamster's anonymous human partner).\nIndustry website Protos reports that Mr. Goxx is up nearly 30% since he started trading digital assets, outperforming returns from bitcoin, the S&P 500 and Warren Buffett's Berkshire Hathaway.\nThe takeaway: Perhaps Mr. Goxx is a market savant, and we should all be tapping hamsters to set us up for retirement. Alternately, his wins back up a well-worn theory: If markets are effective at incorporating all publicly available information, prices are mostly driven by random events. That means a monkey who makes stock picks throwing darts at a board should be able to do just as well as esteemed portfolio managers.\nThere's plenty of room for debate on whether markets really do function efficiently. But financial advisers can point to Mr. Goxx as evidence that average investors would be wisest to invest in a broad range of assets over the long-term, instead of trying to beat the system.\nUp next\nFederal Reserve Chair Jerome Powell and Treasury Secretary Janet Yellen testify before the Senate on the coronavirus recovery starting at 10 a.m. ET.\nAlso today:\nUS consumer confidence data for September arrives at 10 a.m. ET.\nMicron (MICR) reports results after US markets close.\nComing tomorrow: Shares of eyeglass brand Warby Parker are expected to start trading on the New York Stock Exchange. The startup is going public via a direct listing, as opposed to a traditional initial public offering, or IPO.\n"}