{"title":"This hamster's cryptocurrency portfolio is beating the market","date":"2021-09-27","classification":"bad","text":"Title: This hamster's cryptocurrency portfolio is beating the market\nNew York, NY (CNN Business)A German hamster is beating investors at their own game.\nSince June, a hamster named Mr. Goxx has been running an independent portfolio that trades cryptocurrency from a high-tech cage called the Goxx Box. His portfolio has a wide range of cryptocurrencies, including TRON, Ethereum and Bitcoin.\nBitcoin plummets after China intensifies cryptocurrency crackdown\nMr. Goxx's trading sessions are livestreamed on Twitch. First, the hamster runs on an \"intention wheel,\" which spins around and chooses a cryptocurrency. Then, it scampers through either a \"buy\" tunnel or a \"sell\" tunnel, triggering purchases or sales of roughly 20 euros worth of the cryptocurrency.\nMr. Goxx's human business partner, who presumably executes the trades, prefers to remain anonymous but posts the buy and sell orders on Twitter and Reddit. The hamster's \"office hours\" and crypto updates can be followed on its Twitch and Reddit page.\nIn an interview with the crypto website Protos, the human behind Mr. Goxx said that the crypto picks haven't yet been remunerative enough to pay for Mr. Goxx's high-tech digs, which include a desk set up with computer monitors made from wood.\nAs of Saturday, the hamster's performance was up more than 16% since it began trading in June, according to Protos data — an impressive feat for anyone, much less a rodent. Its returns are better than those for Bitcoin, the S&P 500 and Warren Buffett's Berkshire Hathaway (BRKB).\nBitcoin and the S&P 500 have climbed about 14% and 5% respectively, over the same time period. Berkshire Hathaway B shares, meanwhile, have fallen by 2%. Mr. Buffett might want to invest in an intention wheel.\n\"Mr. Goxx is happy to see that some of his investments finally pay off,\" Mr. Goxx's human partner told Protos.\nAfter an initial investment of a little more than 300 euros, or $390, Mr. Goxx had a profit of 54 euros on Sunday, or about $63.\nHowever, that's down from a mid-September high, when Protos data showed the portfolio had risen almost 50%, to almost 500 euros. Bitcoin, the world's most actively traded cryptocurrency, was up just 41% over the same period of time.\nFinancial advisers tout a broad, buy-and-hold investment strategy, arguing that even well-regarded asset-picking portfolio managers will ultimately lose to a monkey making stock picks by throwing darts at a board. Or, in this case, a hamster in a maze.\nEven if Mr. Goxx continues to beat the S&P 500, investing based on a hamster's random movements is not a sound investment strategy. The hamster's Twitch and Reddit accounts make clear that the investments are for entertainment purposes only.\n"}