{"title":"Robinhood reveals new regulatory probes on the eve of its blockbuster IPO","date":"2021-07-27","classification":"bad","text":"Title: Robinhood reveals new regulatory probes on the eve of its blockbuster IPO\nNew York (CNN Business)Regulators are investigating the fact that Robinhood CEO Vlad Tenev is not licensed by FINRA, Wall Street's powerful self-regulator, the online trading platform announced Tuesday.\nNews of the probe comes more than five months after CNN Business reported that Tenev, the public face of Robinhood, is not registered with FINRA, short for the Financial Industry Regulatory Authority. That's despite the fact that he presides over one of the nation's largest and most powerful online brokerages.\nRegulators are also probing Robinhood employees' stock trades that occurred around the time of the company's controversial stock restrictions imposed in January amid the Reddit market turmoil.\nRobinhood said it has received inquiries from FINRA and the Securities and Exchange Commission about employee trades involving GameStop (GME), AMC (AMC) and other so-called meme stocks. Robinhood said regulators are looking into whether these trades by employees \"may have occurred in advance of the public announcement\" of the trading restrictions.\nThese disclosures come on the eve of a blockbuster initial public offering that could value Robinhood at $35 billion.\nIn a filing late Tuesday, Robinhood said it received a FINRA investigative request seeking documents and information related to its compliance with the agency's registration requirements for member personnel.\nRobinhood aims for $35 billion price tag in blockbuster IPO\nRobinhood said the FINRA investigation is related to the \"non-registration status\" of both Tenev and co-founder Baiju Bhatt, who now serves as chief creative officer.\n\"Robinhood is evaluating this matter and intends to cooperate with the investigation,\" the company said in the filing.\nFINRA declined to comment on the matter, noting that its investigations are confidential. Robinhood did not respond to a request for comment.\nRobinhood is expected to price its IPO on Wednesday and begin trading on the Nasdaq the following morning, CNN Business previously reported.\n\"Robinhood is facing lots of scrutiny in the run up to its IPO, and regulators are poring through its operations and structure,\" James Tierney, an assistant professor of law at the University of Nebraska College of Law, said in an email.\nTierney, who previously worked at the SEC on FINRA registration matters, said it's not surprising this scrutiny \"extends to Tenev's registration status, given his prominent role as the public face\" of the company.\nShould Tenev be FINRA-registered?\nThe FINRA investigation comes after Senator Elizabeth Warren, in a February statement to CNN Business, called on regulators to examine whether executives like Tenev \"should be licensed and trained on market rules and risks.\"\nFINRA generally requires that the CEOs of registered broker-dealers be registered with the agency. The aim is to make sure these executives receive compliance training and demonstrate the competence required for leadership roles. Being registered with FINRA also allows the public to track any violations by licensed individuals via the agency's Broker Check tool.\nRobinhood slapped with biggest-ever penalty by Wall Street regulator\nTenev is the CEO of Robinhood Markets, the parent company that is not registered with FINRA. (Robinhood Markets owns a broker-dealer and a clearing broker.)\nThe CEO of a parent company that owns a broker-dealer does not necessarily need to be registered.\nAt the time of the initial CNN report, Robinhood told CNN Business that Tenev does not directly oversee the FINRA-registered managers of the broker-dealer or the clearing broker, but declined to say who does.\nSome experts expressed alarm at the fact that Tenev is not registered with FINRA, while others said it may not be a problem.\nLatest run-in with FINRA\nSome of Robinhood's rivals do have CEOs with FINRA licenses, while others do not. For instance, the CEOs of Charles Schwab (SCHW) and Robinhood rival Webull are registered with FINRA and have their Series 24 licenses as principals.\nHowever, Square (SQ) CEO Jack Dorsey is not listed as being registered with FINRA. (In addition to its payment platform, Square's Cash App lets users invest in bitcoin and individual stocks).\nThe key may be just how involved Tenev is with Robinhood's day-to-day operations. Some of Tenev's prior comments suggest he holds a significant managerial role, including being involved in delicate negotiations with its clearinghouse during the GameStop trading turmoil in January.\nIn a late February letter to Sen. Warren, FINRA said that these determinations are \"fact-specific\" and require \"careful assessment of the individual's activities.\"\nMore than 140 business leaders urge lawmakers to pass infrastructure bill\nThe FINRA licensing investigation is just Robinhood's latest run-in with the regulator.\nLast month, FINRA slapped the brokerage with its biggest-ever penalty and accused the company of harming millions of customers and giving investors \"false or misleading information.\"\nRobinhood neither admitted to nor denied the charges.\n"}