{"title":"Bitcoin plummets after China intensifies cryptocurrency crackdown","date":"2021-09-24","classification":"bad","text":"Title: Bitcoin plummets after China intensifies cryptocurrency crackdown\nBeijing (CNN Business)China is intensifying its crackdown on cryptocurrencies.\nChinese government agencies including the country's securities regulator and the People's Bank of China (PBOC) said in a statement on Friday that all cryptocurrency-related business activities are illegal and vowed to clamp down on illicit activities involving digital currencies.\nThe agencies said that overseas crypto exchanges would be blocked from providing services to Chinese residents through the internet.\nBitcoin (XBT) fell about 5% on the news. Ethereum, another leading cryptocurrency, was down 9%.\nThe agencies said that China would develop \"new systems\" to counter risks posed by cryptocurrencies. China will gradually start shutting down crypto mining operations, and no new mining projects will be permitted, the National Development and Reform Commission said in a separate statement.\nThe announcements are the latest in a series of tough measures from China on cryptocurrencies.\nBitcoin for beginners: Here's what to know before you invest in crypto\nIn May, Chinese Vice Premier Liu He told a group of finance officials that the government would \"clamp down on bitcoin mining and trading activity\" as part of its goal to achieve financial stability. And finance and banking watchdogs said that financial institutions and payment companies should not participate in any transactions related to cryptocurrency, nor should they provide crypto-related services to their clients.\nThe measures aren't just about curtailing financial risk. The computers needed for bitcoin mining eat up a ton of computing power and electricity, raising concerns about the cost to the environment.\nChina was on track to generate more than 130 million metric tons of carbon emissions by 2024, according to a Nature Communications study. That's more than the total annual carbon emissions output from the Czech Republic and Qatar in 2016.\nThat kind of output is also disastrous for China's ambitious climate plans. President Xi Jinping has vowed to make his country carbon neutral by 2060, and the country is already struggling to contain carbon emissions from other industries.\n-- CNN Business' Laura He contributed to this report\n"}