{"title":"Bitcoin for beginners: Here's what to know before you invest in crypto","date":"2021-09-22","classification":"bad","text":"Title: Bitcoin for beginners: Here's what to know before you invest in crypto\nLet's be honest, the advice to \"invest in what you know\" is hard to heed when you're trying to build a diverse portfolio.\nSo even if you're someone who can't define blockchain to save your life, you still may be wondering if you should have at least a little exposure to crypto in your portfolio.\nAfter all, institutional investors and big banks have started taking it seriously. And it's hard to miss news of the meteoric rise in prices for bitcoin and other digital currencies over the past several years.\nHad you bought bitcoin in early April 2017, for example, you could have seen a 3,700% return in just four years.\nBut there also have been plenty of price plunges along the way. If you'd bought in mid-April of this year, you would have lost more than half your investment in just four months.\nSo if you're tempted to invest, here's what to consider before taking the leap.\nIt is a highly speculative investment\nGenerally speaking, there is no intrinsic value underlying most cryptocurrencies.\nUnlike a stock, for instance, they don't track the growth potential of a real-world company selling real-world products and services. Nor do they track the value of a natural resource the way a traditional commodity does.\nCryptocurrency, explained\n(One exception are so-called stablecoins such as tether, USD Coin and binance USD. These are cryptocurrencies pegged to the value of the US dollar, euro and other forms of fiat money, which make them less volatile than non-pegged cryptocurrencies.)\nAlso, none are accepted as legal tender anywhere, except in El Salvador, which in early September adopted bitcoin as a national currency alongside the US dollar.\nSo by investing in a digital currency today, \"your sole source of a return is betting that someone else will be willing to pay more for [it] in the future than you did,\" said Minnesota-based certified financial planner Matt Elliott.\nThat might be a fair bet given growing mainstream interest in crypto, especially with some of the bigger currencies like bitcoin, which has a market cap worth nearly half the total crypto universe, according to Charles Schwab.\nBut it's just as fair a bet to assume that many crypto currencies will flame out, much the way so many companies did in the dot-com era, noted New York-based chartered financial analyst Ryan Sterling.\n\"On the upside, we could see a 10x return in the next five years. That said, we would not be surprised if they were worthless in five years,\" he said.\nDon't bet what you can't afford to lose\nWhile he's not a huge fan of crypto, Sterling sees it as something that, in very small doses, might help clients get more diversification, since it performs so differently from stocks and bonds.\nSterling advises interested clients to invest no more than 2% of their liquid portfolios in digital currencies. In other words, they should only invest a small percentage of the money they have above and beyond their home equity and their retirement and education savings.\nYes, the IRS can tax bitcoin and other cryptocurrencies. What you need to know\n\"By investing 2% they feel like they're participating, but not so much that it creates problems,\" Sterling said.\nElliott suggests having no more than 5% of your overall portfolio dedicated to speculative investments of all kinds, including crypto, but only if you have little to no debt and are willing to accept the risk of losing what you put in.\nArizona-based certified financial planner Christine Papelian thinks direct exposure to crypto is too volatile for her clients, who are primarily investing for retirement\nBut she said she reminds clients that they may already have some indirect exposure to crypto assets through investments in tech companies that invest in blockchain technology, which makes it possible for the crypto trading universe to function. Or investors may have exposure through actively traded mutual funds and exchange-traded funds, which themselves may have crypto or crypto-related companies, like Coinbase, in their portfolios, Papelian said.\nThere are very few protections\nAnother factor to consider: Direct ownership and transactions with crypto assets are mostly unregulated and offer very little consumer protection.\n\"We just don't have enough investor protection in crypto finance, issuance, trading or lending. ...[I]t's more like the Wild West...This asset class is rife with fraud, scams and abuse in certain applications,\" SEC Chairman Gary Gensler noted in written Congressional testimony.\nThe rules for how to report and pay tax on crypto assets are also in the very early stages. But the regulations that currently exist get particularly cumbersome if you ever decide to buy something with the crypto you own.\nRules and regulations are likely to increase in the foreseeable future. And that could affect prices positively or negatively.\nEasier ways to get exposure\nUnless you're comfortable with buying a cryptocurrency directly and storing it in a secure digital wallet, there are easier ways to get access.\nSterling typically invests his clients' money in bitcoin and Ethereum trusts run by Grayscale, currently the world's largest digital currency asset manager.\nIf you're not working with a financial adviser, you also can get indirect exposure by buying shares in Grayscale funds and other third-party investment crypto products in the over-the-counter secondary market through some large retail trading platforms, such as Schwab.com and Fidelity.com.\nThe company's most popular fund -- the Grayscale Bitcoin Trust (GBTC) -- will likely become an ETF, if and when the SEC approves bitcoin ETFs in the United States. But in the meantime, it will adhere to the same SEC reporting and disclosure requirements that ETFs operate under today, said Grayscale CEO Michael Sonnenshein.\nIn either case, mind the fees, which are far higher than index fund fees.\nShould the SEC eventually approve bitcoin ETFs, expect to see big players offering them, like Fidelity, which has already filed an application to launch one.\nTalk with your spouse before taking the leap\nIf you're married, don't let crypto come between you.\n\"The most challenging client conversations I've had involving cryptocurrency investment are with spouses, usually with one or two children, and no tech background,\" said New Orleans-based certified financial planner Mike Turi.\nEven when such couples are unified in having a high risk tolerance, one spouse may prefer to risk money on a more tangible speculative investment, such as a small-cap biotech company or a friend's startup, he explained.\nHis best advice? \"Planning always prevails. Start with a client's plan and end with how cryptocurrency investing affects their current track. In my experience, this is the best way for spouses to make an informed, joint decision. A lot more powerful than beginning with the question - 'Is bitcoin a good investment?'\"\n"}