{"title":"5 things to know for September 23: Covid, debt ceiling, immigration, policing, France","date":"2021-09-23","classification":"good","text":"Title: 5 things to know for September 23: Covid, debt ceiling, immigration, policing, France\nGet '5 Things' in your inbox\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN)The wild home-selling blitz is cooling down in the US, but home prices are still ludicrously high. The average home price last month was up 14.9% from a year ago.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here.)\n1. Coronavirus\nThe US Food and Drug Administration announced it will grant emergency use authorization for a booster dose of Pfizer's Covid-19 vaccine in people 65 and older, people at high risk of severe disease and people whose jobs put them at risk of infection. That last category includes health care workers and also people who work in places like grocery stores, homeless shelters and prisons. Today, vaccine advisers to the CDC will meet to act on the FDA's decision. The CDC must give its stamp of approval before any booster doses can be officially given. (Third doses are already approved for certain immunocompromised people.) A member of the CDC's vaccine team said yesterday that findings from several studies show vaccine protection against Covid-19 does wane over time, especially for older people. \nGOP members go 'doctor shopping' for Covid-19 deniers 03:48\n2. Debt ceiling\nDemocrats are nervous about expected Republican pushback in the Senate over the debt ceiling. Instead of facing up to GOP resistance leading up to the mid-October deadline, some Dems are considering lengthy, laborious legislative methods to pass a measure to raise or suspend the debt ceiling without Republican help. If the US were to default, the government would have to limit its spending, and that would spell real consequences for millions of Americans. Social Security payments and the next monthly child tax credits could be delayed, and food stamp recipients could be left waiting for funds. A default also could set off a recession that would wipe out millions of jobs and erase about $15 trillion in household wealth, a report from a financial services company warns. \nMoody's chief economist: US default would be 'cataclysmic' 03:32\n3. Immigration\nAs the crush of migrants along the southern US border persists, Border Patrol agents in Del Rio, Texas, say they had asked their leaders as far back as June for extra help to rapidly process migrants. Agents this summer began to see an increase in people crossing the Rio Grande into the US, at times getting up to several hundred congregating under the Del Rio International Bridge. In recent days, that number ballooned to 14,000. The Biden administration is scrambling to deal with the crisis by ramping up deportation flights and talking with officials in Brazil and Chile about repatriating migrants who'd lived there. Photos of refugees arriving in Del Rio show a dangerous, desperate journey through heat and muddy water to the squalid, tight encampments that have raised alarm bells among health and humanitarian experts.\nDecomposing bodies, rapes, assaults: Pair survives journey to the US 02:44\n4. Policing\nAfter months of negotiation, a bipartisan effort to move forward with federal police reform legislation has officially ended without a deal. Sen. Cory Booker and Rep. Karen Bass, both Democrats, and Republican Sen. Tim Scott led the talks, but they say complex issues like qualified immunity (a legal doctrine that protects police officers from being sued in civil court) kept them from finding a plan that would garner bipartisan support in the Senate. After the breakdown, President Biden criticized Republican leaders for rejecting even modest reforms and is now considering taking executive action on policing reforms. Meanwhile, a group of former and current Black women officers have filed a class action lawsuit against the Metropolitan Police Department in Washington, DC, claiming racial and sexual discrimination.\nClyburn: Police reform 'teetering' but 'I think we're going to get there' (July) 01:22\n5. France\nBiden spoke with French President Emmanuel Macron yesterday for the first time since a major diplomatic dispute erupted between the two countries over a trilateral deal among the US, UK and Australia. The fallout of the deal, which includes the provision of nuclear-powered submarines to Australia, led to tension during this week's United Nations General Assembly and inspired unrestrained criticism from some French officials. Macron, however, has been more reserved. A joint statement from the US and France after the call said Macron and Biden \"agreed that the situation would have benefitted from open consultations among allies on matters of strategic interest to France and our European partners.\"\nCNN reporter breaks down implications of Biden-Macron call 02:01\nBREAKFAST BROWSE\nNetflix buys the rights to Roald Dahl's beloved stories\nGet ready to be transported straight back to childhood. \nDahl's Matilda confronts Trump in new statue 00:32\nPeople who eat more dairy fat have lower risk of heart disease, study suggests\nRepeat this to yourself the next time you tear into a wheel of brie. \nYoung designers rule the highlights from London Fashion Week\nHmm, what are the fancy people wearing these days? \n\nHide Caption\n32 of 32\nPhotos: 2021 London Fashion Week highlights\nHighlights from the London Fashion Week Sping-Summer 2022 shows: Irish designer Richard Malone showcased his latest ready-to-wear collection in the middle of the Victoria & Albert Museum. Scroll for more.\nHide Caption\n1 of 32\n\nElvira, famed 'Mistress of the Dark,' shares she's been in a 19-year relationship with a woman\nShe's living her best spooky life!\nBitcoin for beginners: Here's what to know before you invest in crypto\nStep 1: Actually, confidently, truly understanding what Bitcoin is. \nTODAY'S NUMBER\n3.3 million\nThat's how many deaths could have been avoided globally in 2016 under the World Health Organization's newly released air quality guidelines, the organization said. \nSee picturesque Lake Tahoe obscured by smoke from wildfire 02:21\nTODAY'S QUOTE\n\"Dad knew that Black images matter. If a picture is worth a thousand words, what was a movie worth?\"\nDirector Mario Van Peebles, memorializing his father, director Melvin Van Peebles, who has died at 89. The elder Van Peebles was a trailblazing African American director who helped champion a new wave of modern Black cinema in the 1970s.\nMelvin Van Peebles, trailblazing director and Black cinema champion, has died\nTODAY'S WEATHER\nTropical Depression 18 to strengthen 02:31\nCheck your local forecast here>>>\nAND FINALLY\nHow wax figures are made\nEven after seeing the incredible painting techniques they use and the molding and measuring and everything else, the creation of lifelike wax figures still feels like magic. (Click here to view.)\n"}