{"title":"Wall Street's rebound attempt after worst losses in months falls flat","date":"2021-09-21","classification":"bad","text":"Title: Wall Street's rebound attempt after worst losses in months falls flat\nNew York (CNN Business)US stocks tried but failed to rebound Tuesday, after concerns about potential contagion from Chinese real estate giant Evergrande's debt crisis led to the worst session for the market in months.\nAfter weeks without a clear driver for markets, Evergrande's trouble came at just the right time to trigger a massive selloff. Analysts have long said a correction of prices was necessary given how long the recovery rally has been going on.\nBut after Monday's steep drop, things seem to have calmed down. Wall Street opened with green arrows across the board but had a volatile session and finished only mixed.\nThe Dow (INDU) ended 0.2%, or 51 points, lower. The S&P 500 (SPX) also fell 0.1.%, while the Nasdaq Composite (COMP) closed 0.2% higher.\nThe 10-year US Treasury bond yield inched higher to 1.32% around the time of the close. Yields fell and prices rose Monday as investors rushed into the safety of Treasuries.\nBitcoin, which sold off Monday, still traded lower, down more than 4%.\nWhat's next for Evergrande?\nEvergrande is stumbling under its $300 billion debt burden ahead of a $100 million interest payment on two of its bonds later this week.\nShould the conglomerate actually default, the aftershocks would likely ripple across financial markets, bringing up memories of the financial crisis on the thirteenth anniversary of the collapse of Lehman Brothers.\nBut unlike Lehman Brothers, an Evergrande default — should it even come to that — might be much more contained and only affect selected financial institutions.\nAnother big question is whether the Chinese government might be willing to bail the company out. But so far Beijing has remained quiet.\nWhat's next for Wall Street?\nEven without Evergrande, Wall Street had a lot going on.\n\"We've been in the camp that we're overdue for a correction, something in the 5-10% range that is a buyable pullback and we seem to be getting that now,\" said Cliff Hodge, chief investment officer for Cornerstone Wealth. That's why he wasn't worried about a market crash even as stocks tumbled Monday.\nOther things are indeed weighing on the market.\nThere's the Delta variant of the coronavirus boosting infections across the nation, weighing on consumer sentiment and hiring in industries reliant on face-to-face contact. The Back-to-Normal Index from CNN Business and Moody's Analytics dropped to its lowest level since early June on Friday, reflecting Delta's impact on the recovery.\nEconomic data could be choppy in the months ahead. Tuesday's release of August housing data showed a higher number of building permits and housing starts than expected.\nThen there's America's own debt problem as Washington is trying to raise the debt ceiling. If it doesn't get done, the federal government could run out of cash as early as next month, according to a warning from Treasury Secretary Janet Yellen at the start of September.\nThe debt ceiling issue comes around on a regular basis, but it's promising to be another showdown in Congress. And markets will be nervous until the problem is resolved — even though the idea of America defaulting on its debt is frankly inconceivable.\n\"While concerns over contagion from China's Evergrande bond debacle helped spark the selloff, fiscal policy worries were more the culprit,\" wrote economists at Action Economics in a note to clients.\nAnd if that weren't enough, the Federal Reserve's two-day policy meeting gets underway Tuesday ahead of the central bank's official update on Wednesday.\nJust a few weeks ago, investors were convinced the Fed would announce a rollback of its pandemic-era stimulus measures this week. But a disappointing August jobs report and worries about how much Delta is slowing the recovery have pushed out expectations for a tapering of stimulus until later this year.\n"}