{"title":"Bitcoin falls as crypto gets caught up in Evergrande selloff","date":"2021-09-21","classification":"bad","text":"Title: Bitcoin falls as crypto gets caught up in Evergrande selloff\nHong Kong (CNN Business)Bitcoin is falling as fears of the Evergrande crisis sweep through global markets.\nThe digital currency has dropped 5.7% in the last 24 hours, and was trading at $42,955 per coin as of 2:43 am ET on Tuesday, according to cryptocurrency tracker Coindesk.\nEarlier, it was down as much as 12%.\nOther cryptocurrencies are tumbling, too. Ethereum and dogecoin have each declined 4.4% and about 6%, respectively, in the past 24 hours.\nThe fall followed a major drop in US stocks on Monday, as Wall Street's fears turned to China. Investors have been uneasy over the deepening crisis of Evergrande, a massive Chinese property conglomerate that's at risk of defaulting.\nIt was the worst performance since May for the S&P (SPX) and the Nasdaq (COMP), while the Dow (INDU) logged its worst day since July.\nStocks tumble as Wall Street's fears turn to China\nExperts have characterized Evergrande's struggles as a major test for Beijing, with some worrying about whether the company risks creating China's Lehman Brothers moment. While other analysts have said it's far from certain that Evergrande's crisis will become a similarly far-reaching event, the crisis has sent shockwaves across the world.\nThe property firm, which is struggling to manage its $300 billion mountain of debt, was supposed to pay the interest on some of its bank loans Monday, according to Bloomberg. Evergrande did not respond to a request from CNN Business for comment about those payments.\nInterest on two of its bonds worth more than $100 million is also due later this week, according to Refinitiv. Shares of Evergrande fell 5.7% in Hong Kong on Tuesday, extending Monday's losses.\nEven though the company primarily serves mainland China, investors around the world are worried. The massive amount of money borrowed by Chinese companies has long been considered a looming threat to market stability. Now investors fear the exposure that banks might have to Evergrande and companies like it.\nUS banks fell on Monday, with Goldman Sach (GS) and JPMorgan (JPM) among the Dow's worst performers.\nThe issue had already weighed on Hong Kong markets earlier in the day, as Chinese banks, insurers and other real estate companies were slammed.\n5 things to know about Evergrande, the Chinese business empire on the brink\nEdward Moya, senior market analyst of the Americas at Oanda, said on Monday that bitcoin was no different from other assets.\n\"The fallout from the Evergrande is putting a tremendous dent in risk appetite that is sending everything lower,\" he wrote in a note to clients.\nMoya noted that cryptocurrencies had performed well this year, \"despite all the volatility.\"\n\"So it should not surprise Wall Street they are the first asset sold in the beginning of China-driven market selloff,\" as investors aim to cash in, he added.\nOthers have taken the occasion to double down. Nayib Bukele, the president of El Salvador who is known for his bullish stance on bitcoin, tweeted Monday that \"we just bought the dip.\"\nThe country purchased 150 bitcoins, and now holds 700 coins, he added.\nEarlier this month, Bukele announced that El Salvador had become the world's first country to adopt the digital currency as legal tender.\n-— Anneken Tappe and Laura He contributed to this report.\n"}