{"title":"This could make bitcoin bigger than ever","date":"2021-10-18","classification":"good","text":"Title: This could make bitcoin bigger than ever\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the same link.\nLondon (CNN Business)This year, cryptocurrencies have been up. They've been down. But they never seem to be entirely out.\nWhat's happening: Hype around bitcoin is building again, with a financial tool that could boost public exposure to the digital currency poised to make its debut this week.\nAfter plunging this spring, bitcoin is now trading above $60,000 — not far off the all-time high of more than $64,800 achieved in April. It's jumped more than 40% so far this month.\nDriving the gains: Investors are excited about the anticipated launch of the first bitcoin futures exchange-traded fund. The ProShares Bitcoin Strategy ETF will go live on Tuesday, according to the company.\nThe fund will provide an entry point for investors who are interested in cryptocurrencies but don't want to deal with buying and selling the tokens themselves.\nThe SEC signaled last week that it could finally approve such an instrument, which the crypto industry has long lobbied for.\n\"Before investing in a fund that holds bitcoin futures contracts, make sure you carefully weigh the potential risks and benefits,\" the agency tweeted.\nShould it go ahead, the ETF could supercharge bitcoin's recent rally.\n\"We view the approval of a Bitcoin futures ETF as a positive step for the digital asset space,\" Isaac Boltansky, BTIG's director of policy research, said in a recent note to clients.\nThat doesn't mean regulators are completely ditching their distrust of cryptocurrencies. Boltansky noted that a futures ETF is different from an ETF that buys and sells bitcoin directly. On that front, the SEC appears to remain skeptical.\nAnd the rollout of stricter global rules continues to loom. Oversight bodies face more pressure to act as the pool of investment grows.\nIn a recent speech, Bank of England official Jon Cunliffe noted that the collapse of the $1.2 trillion market in subprime mortgage-backed securities triggered the 2008 financial crisis. Crypto assets, meanwhile, have grown to $2.3 trillion.\n\"$2.3 trillion of course needs to be seen in the context of the $250 trillion global financial system,\" Cunliffe said. \"But as the financial crisis showed us, you don't have to account for a large proportion of the financial sector to trigger financial stability problems.\"\nSome industry players see the writing on the wall. Coinbase published a proposal for regulating digital assets last Thursday. The company, which went public earlier this year, called for a designated US body to monitor crypto assets.\n\"Where new policy questions or challenges arise, the ability of a single dedicated regulatory body to respond in an efficient and timely manner benefits everyone,\" Coinbase said in a research paper.\nGoldman Sachs takes full control of China securities venture\nGoldman Sachs has received clearance to take full ownership of its securities joint venture in China, a sign that Beijing remains open to foreign financial firms even as geopolitical tensions simmer.\nChina's economy is getting walloped by crises in energy, shipping and real estate\nThe latest: Goldman announced Sunday that the entity, previously named Goldman Sachs Gao Hua Securities Company, will be renamed Goldman Sachs Securities Company. The unit offers investment banking and securities services to clients in mainland China.\n\"This marks the start of a new chapter for our China business following a successful 17-year joint venture,\" CEO David Solomon said in a letter to employees.\nRemember: Wall Street has long sought greater access to mainland China, a market where bankers see huge potential. The process has been arduous, however, with the country moving extremely slowly to open its doors to financiers without local partners.\nCorporate America sees China as a long-term bet that it expects will pay off despite persistent political strain and slower growth.\nThe country's economy expanded by just 4.9% in the third quarter, according to official data published Monday. That was the weakest rate of expansion in a year as the country contends with a major energy crunch and supply chain disruptions.\nThere are also fears about debt loads in China's property sector, which accounts for as much as 30% of GDP.\n\"The challenges of keeping the economy running smoothly have increased,\" said Fu Linghui, spokesperson for the National Bureau of Statistics.\nLabor is flexing its muscle as workers gain leverage\nAcross the United States, workers are saying enough is enough — and many are either hitting the picket lines or quitting their jobs as a result.\nFor the first time in decades, employees, rather than employers, have power to wield in the labor market, which is reorienting itself in the wake of Covid-19, my CNN Business colleague Chris Isidore reports. That's empowering unions, which have been much weaker in the 21st century than in the past.\nAt John Deere (DE), 10,000 workers went on strike last Thursday after rejecting a tentative deal that would have improved wages and benefits, calling for \"a better share of the pie, a safer workplace and adequate benefits.\" They joined 1,400 strikers at Kellogg (K) upset with seven-day work weeks and a two-tier retirement system. Pilots from American Airlines are set to hold demonstrations at the Miami airport on Tuesday.\nStep back: Businesses have been struggling to find the workers they need to fill a record number of job openings. There has also been a record high number of workers quitting jobs.\nThat gives employees greater bargaining power — which many are determined to use.\n\"My nurses and health care professionals are angry,\" said Elizabeth Hawkins, negotiator for a union of 32,000 nurses that could soon go on strike at hospitals and clinics in Southern California and Hawaii run by health care giant Kaiser Permanente.\nHistory lesson: Robert Reich, a former US labor secretary, said that workers also made major gains after the tumult of World War I and World War II.\n\"It may have taken a pandemic to open people's eyes,\" he said. \"Many people are frazzled. A lot of workers are saying, 'I've had it!'\"\nUp next\nState Street and Albertsons report results before US markets open.\nAlso today:\nUS industrial production data for September arrives at 9:15 a.m. ET.\nThe NAHB Housing Market Index for October follows at 10 a.m. ET.\nApple is set to unveil two high-end MacBook Pro laptops at 1 p.m. ET.\nComing tomorrow: Earnings from Johnson & Johnson (JNJ), Procter & Gamble, United Airlines (UAL) and Netflix (NFLX).\n"}