{"title":"Jamie Dimon bashes bitcoin again, calling it 'worthless'","date":"2021-10-12","classification":"good","text":"Title: Jamie Dimon bashes bitcoin again, calling it 'worthless'\nNew York (CNN Business)Say what you want about JPMorgan Chase CEO Jamie Dimon, but he's consistent about his disdain for bitcoin.\nDimon once again attacked the top cryptocurrency, calling it \"worthless\" during a virtual summit Monday.\n\"I personally think bitcoin is worthless, but I don't want to be a spokesperson,\" he said during a virtual appearance at the Institute of International Finance Meeting before adding, \"I don't care, it makes no difference to me. I don't think people should smoke cigarettes.\"\nBut Dimon added that his own take on bitcoin has not stopped the bank from allowing its customers to buy and sell the cryptocurrency...even though JPMorgan Chase (JPM) itself will not hold it.\n\"Our clients are adults, they disagree. That's what makes markets. If they want access to buy and sell bitcoin...we can give them legitimate, clean-as-possible access,\" he said.\nNovogratz on crypto volatility: Investors now value identity 03:44\nDimon also continues to support the idea that some digital currencies that run on a blockchain network do have value, especially if they are so-called stablecoins pegged to the dollar or other government-backed currencies. The bank has its own JPM Coin for payments.\nStill, Dimon's sarcastic remarks about bitcoin come as the price of the cryptocurrency has surged in recent weeks to about $57,000. Bitcoin has nearly doubled this year and is now only about 12% below the all-time high of just under $65,000 earlier this year.\nDimon has been a bitcoin bear for the past few years — despite that it has soared in value along with other cryptocurrencies.\nDimon first called bitcoin a \"fraud\" in 2017. He added at the time that he thought bitcoin was \"stupid\" and \"far too dangerous.\"\nMore recently, Dimon said during an appearance on the Axios HBO show earlier this month that bitcoin was \"a little bit of fool's gold,\" and that \"it's got no intrinsic value.\" (HBO, like CNN Business, is a part of AT&T (T)-owned WarnerMedia.)\nDimon also predicted that \"regulators are going to regulate the hell out of it.\"\nAttacking bitcoin for years but the crypto keeps climbing\nDimon isn't the only top financial voice to be skeptical of bitcoin. Berkshire Hathaway's (BRKB) Warren Buffett and Charlie Munger are notable bitcoin bashers too.\nBut an increasing number of top financial tech firms, such as Square (SQ) and PayPal (PYPL), as well as prominent investors like Mike Novogratz, Stanley Druckenmiller and Paul Tudor Jones, have all embraced bitcoin.\nCrypto 101\nJust last week, the family office of George Soros disclosed that it has invested in bitcoin too.\nSo time will tell if Dimon winds up being right to repeatedly question bitcoin's value. But his continued attack on the cryptocurrency seems to be falling on deaf ears with investors.\n\"Jamie Dimon calling Bitcoin 'worthless' is nothing new and has been shrugged off by the market,\" said Nicholas Cawley, analyst at DailyFX, in a report Tuesday.\nCawley added that since Dimon referred to bitcoin as being worse than the Dutch tulip mania bubble of the 1600s four years ago, bitcoin has surged from about $4,500 to its current price approaching $60,000.\nJPMorgan Chase will report earnings for the third quarter Wednesday morning. Investors will be tuning in to see if Dimon has any more choice comments about bitcoin during either the media or analyst conference calls.\n"}