{"title":"Coronavirus aftershocks just keep coming","date":"2021-10-07","classification":"good","text":"Title: Coronavirus aftershocks just keep coming\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)We hate to be the bearers of bad news. But the pandemic just keeps delivering setbacks for the global economy.\nSupply chains have been stretched beyond breaking, inflation is rising sharply across developed economies and an energy crisis looms.\nThe latest problem spot is Germany, where manufacturing production fell 4.7% in August compared to the previous month. Industrial output was 9% below its February 2020 level.\nThe shock decline was driven by a massive 17.5% fall in the production of vehicles and auto parts, according to Andrew Kenningham of Capital Economics. German car production is running 40% below pre-pandemic levels.\nIt's hard to overstate the importance of the car industry to Europe's largest economy. More than 880,000 people work in auto manufacturing, and German factories produced over 4.6 million cars in 2019.\nSnowcone the Happy Unicorn is the latest victim of manufacturing chaos\nMany carmakers have been struggling to source parts as the pandemic continues to snarl global supply chains. Computer chips are in particularly short supply.\nThe German economy will post a big growth number for the third quarter, Kenningham said, in part because of the reopening of its hospitality sector. But the prospects for the fourth quarter have \"deteriorated significantly.\"\n\"With conditions having worsened since [August], Germany's manufacturing problems threaten to keep overall economic activity well below its pre-pandemic level until next year,\" said Kenningham.\nStretched supply chains may be the biggest problem facing advanced economies at the moment. But another crisis looms.\nA global energy crunch caused by weather and a resurgence in demand is getting worse, stirring alarm ahead of the winter, when more energy is needed to light and heat homes, reports CNN Business' Julia Horowitz.\nGovernments around the world are trying to limit the impact on consumers, but acknowledge they may not be able to prevent bills spiking. Some countries may order factories to shut down to conserve power.\nRising energy prices are contributing to inflation, which was already a major concern for investors. Central banks could be forced to roll back stimulus sooner than expected in order to tame price hikes.\nOPEC and its allies, which could help ease the energy crunch, are taking a cautious approach. They decided earlier this week to stick to a plan to gradually boost oil output, defying pressure to open the taps wider.\nWhy? The pandemic, of course.\n\"We are scared of the fourth wave of corona, no one wants to make any big moves,\" and OPEC+ source told Reuters.\nCathie Wood is on the move\nCathie Wood is moving her business to Florida.\nArk Investment Management is permanently closing its New York office and relocating to St. Petersburg, Florida, the company announced Wednesday.\nWood's flagship Ark Innovation exchange-traded fund surged nearly 150% in 2020, turning her into a Wall Street superstar.\nWood does things differently, and she's laser-focused on the tech industry. So perhaps it's no surprise that she's leaving Wall Street behind.\nArk said it believes the relocation will \"advance its business as it scales and continues to redefine the asset management industry,\" as well as \"increase collaboration between and among the communities focused on innovation.\"\n\"Ark is not a traditional Wall Street asset management firm, and we are looking forward to breaking the mold further by relocating to St. Petersburg, a city investing in technology, science, and innovation,\" added Wood.\nThis year hasn't been nearly as kind to Wood as the last. The Innovation ETF is down 3.5% heading into the fourth quarter, despite a red-hot market for tech with the Nasdaq up more than 14% so far in 2021.\nA change of scenery might be just what the doctor ordered.\nBitcoin has a new backer\nBitcoin is back, and it has a prominent new supporter.\nThe price of the world's most valuable cryptocurrency spiked nearly 10% Wednesday to around $55,000, following news that the investment firm founded by billionaire George Soros owns bitcoin.\nSoros, who is famous for making big money on traditional currency investments, is rumored to have been trading in bitcoin for the past few months, reports my CNN Business colleague Paul R. La Monica.\nBitcoin soars past $55,000 on George Soros fund endorsement\nThe bitcoin surge comes one day after prices popped above $50,000 for the first time in four weeks. The head of Soros Fund Management argues bitcoin has even more long-term potential.\n\"I'm not sure bitcoin is viewed only as an inflation hedge here. It's crossed the chasm to mainstream,\" said Dawn Fitzpatrick, CEO and chief investment officer of Soros Fund Management, in an interview at the Bloomberg Invest Global Summit.\nUp next\nConagra (CAG) earnings are out before the opening bell.\nAlso today:\nUS jobless claims will be released at 8:30 a.m. ET.\nEIA natural gas inventories data at 10:30 a.m. ET.\nComing tomorrow: Friday's main event is the US jobs report for September. Is the labor market recovering from a dreadful August?\n"}