{"title":"Pizza for Italy and Dracula for Romania. South Korean broadcaster apologizes for its Olympic 'inexcusable mistake'","date":"2021-07-25","classification":"bad","text":"Title: Pizza for Italy and Dracula for Romania. South Korean broadcaster apologizes for its Olympic 'inexcusable mistake'\nSeoul, South Korea (CNN)The Tokyo Olympics opening ceremony is a gratuitously enjoyable affair, with bulging muscles and beaming athletes proudly walking the Parade of Nations -- and into our hearts.\nThe made-for-TV spectacle is an entry way for some viewers to learn more about countries and athletes that they are less familiar with. But in trying to bridge that knowledge gap, one South Korean broadcaster failed spectacularly, drawing from a bank of offensive stereotypes to depict several countries.\nWhen Haiti's athletes walked onto the stadium, a caption posted on screen by South Korea's MBC network read: \"The political situation is fogged by the assassination of the president.\"\nWhen Syrian athletes entered, MBC aired a caption that said: \"Rich underground resources; a civil war that has been going on for 10 years.\"\nNovak Djokovic says current weather conditions in Tokyo are 'brutal'\nAnother MBC caption described the Marshall Islands as \"once a nuclear test site for the US.\" And when Ukraine's athletes entered the parade, MBC showed an image of the Chernobyl disaster -- the world's worst nuclear accident.\nTeam Italy takes part in the opening ceremony on July 23.\nWhen Italy walked on, the broadcaster pulled up an image of a pizza. For Norway, a salmon fillet was shown. An image of Dracula was used for Team Romania. And for Team El Salvador, a country where Bitcoin is legal tender, a picture representing the cryptocurrency was shown.\nThe broadcaster's gaffe led to a deluge of online criticism, with one South Korean Twitter user writing: \"MBC wow, how would it be if South Korea was introduced as the country of Sewol ferry disaster?\"\nOn Saturday, MBC issued a formal apology to the \"countries concerned and our viewers.\"\n\"The images and captions are intended to make it easier for the viewers to understand the entering countries quickly during the opening ceremony,\" the statement said.\n\"However we admit that there was a lack of consideration for the countries concerned and inspection was not thorough enough. It is an inexcusable mistake.\"\nThe broadcaster also promised a full review of its editorial process, vowing no more Olympic blunders.\nMBC is not the only broadcaster coming under fire for its coverage of the Games so far.\nChina's Consulate General in New York has criticized the American network NBC for using \"an incomplete map of China\" when broadcasting the Chinese delegation's entry at the Tokyo Olympics opening ceremony.\nIn a statement released on social media Saturday, the consulate's spokesperson said the map \"created a very bad influence and harmed the dignity and emotion of the Chinese people\" and urged NBC to \"to recognize the serious nature of this problem.\"\n\"The Consulate General in New York would like to point out that the map is an expression of national territory, which symbolizes national sovereignty and territorial integrity,\" the statement said, adding: \"Attempts to use the Olympic Games to play political \"tricks\" and self-promotion to achieve ulterior motives will never succeed.\"\nNBC's map of China did not include Taiwan or the South China Sea. The broadcaster told CNN that they do not wish to comment on the matter at this time.\nCNN's Beijing bureau and Kevin Dotson contributed reporting.\n"}