{"title":"Bitcoin soars past $55,000 on George Soros fund endorsement","date":"2021-10-06","classification":"good","text":"Title: Bitcoin soars past $55,000 on George Soros fund endorsement\nNew York (CNN Business)Bitcoin is back, and it has a prominent new supporter.\nThe price of the world's most valuable cryptocurrency spiked nearly 10% Wednesday morning to around $55,000, following news that the investment firm founded by billionaire George Soros owns bitcoin.\nSoros, who is famous for making big money on traditional currency investments, is rumored to have been trading in bitcoin for the past few months.\nThe bitcoin surge comes one day after prices popped above $50,000 for the first time in four weeks.\nAnd the head of Soros Fund Management argues bitcoin has even more long-term potential: \"I'm not sure bitcoin is viewed only as an inflation hedge here. It's crossed the chasm to mainstream,\" said Dawn Fitzpatrick, CEO and chief investment officer of Soros Fund Management, in an interview at the Bloomberg Invest Global Summit late Tuesday.\nCrypto 101\nFitzpatrick told Bloomberg that Soros Fund Management owns \"some coins...but not a lot.\"\nBitcoin and other cryptos have rallied sharply this year, despite concerns about a crackdown in China and the possibility of tougher regulations in the United States. That's thanks to factors like rising interest rates and the fact that more big financial firms are investing in digital currencies.\nThe value of all bitcoins in circulation is now back above $1 trillion — more than the market value of Facebook (FB). And all cryptocurrencies together represent $2.3 trillion in circulation, matching the market value of the most highly valued stock: Apple (AAPL).\nEl Salvador recently became the first nation to adopt bitcoin as legal tender. Bitcoin fans argue that the cryptocurrency should see near term benefits from inflation pressures and higher bond yields, as government-backed paper currencies like the dollar, euro and yen lose some of their purchasing power as rates rise.\nWill cryptocurrency replace the dollar? Scott Galloway explains 03:15\nStill, several prominent business leaders and investors have expressed reluctance to embrace bitcoin and other cryptocurrencies. Mega-billionaire Warren Buffett continues to criticize bitcoin. And so did JPMorgan Chase (JPM) CEO Jamie Dimon in a recent appearance on the Axios HBO TV show.\nBut the fact that the Soros family office, which manages money for the billionaire philanthropist, now publicly has some skin in the crypto game adds to the legitimacy of the sector.\nCrypto bulls also cheered after US Bancorp (USB) announced plans this week to offer more cryptocurrency custody services for large institutional investors that want to trade bitcoin.\n\"Investor interest in cryptocurrency and demand from our fund services clients have grown strongly over the last few years,\" said Gunjan Kedia, vice chair of U.S. Bank Wealth Management and Investment Services in a news release. \"Our fund and institutional custody clients have accelerated their plans to offer cryptocurrency.\"\n"}