{"title":"The world is flush with cash. It won't be forever","date":"2021-10-06","classification":"good","text":"Title: The world is flush with cash. It won't be forever\nA version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\nLondon (CNN Business)A record setting number of mergers. Eye-popping startup fundraising. Institutional hype over bitcoin.\nNo matter where you look, the evidence is clear: The financial system is awash with cash from pandemic-era stimulus programs, forcing money managers to find new ways to deploy it.\nTake mergers and acquisitions. Worldwide dealmaking has totaled $4.4 trillion in 2021, according to a new report from data provider Refinitiv.\n\"With the all-time full-year dealmaking record broken in less than nine months and five consecutive quarters of more than $1 trillion in M&A activity, we have very little data to make true historical comparisons,\" said Matt Toole, Refinitiv's director of deals intelligence.\nCompanies are also rushing to raise money on public markets, as investors scramble to buy shares of new debuts.\nWall Street revels in the biggest IPO boom in decades\nGlobal initial public offerings have racked up $301 billion so far this year, setting aside special-purpose acquisition companies, or SPACs. That's more than double levels from a year ago, and the strongest first nine months for global IPOs since Refinitiv's records began in 1980.\nSupporters aren't sitting around waiting for firms to go public, either.\nValuations for early-stage startups in the United States hit an all-time high in the second quarter of the year, according to PitchBook.\n\"Increased economic confidence and a positive outlook for the second half of 2021, coupled with a surplus of capital from record levels of dry powder and an influx of nontraditional and crossover investors, have drastically buoyed [venture capital] valuations to new heights,\" the research firm said in a report.\n(Want to read about a startup with a dubious track record that had no problem raising tons of money? Check in on Ozy Media.)\nThe Financial Times also reports that cash-laden private equity firms are dangling the highest premiums for listed companies in more than two decades.\nPlus, despite its huge price crash earlier this year, bitcoin is still drawing attention from institutional investors willing to take risks, sending its price back above $50,000. On Tuesday, U.S. Bancorp said that it had launched a custody service for institutional investment managers who want help storing cryptocurrencies.\n\"Investor interest in cryptocurrency and demand from our fund services clients have grown strongly over the last few years,\" executive Gunjan Kedia said in a statement.\nBig picture: Some central banks are debating when to roll back crisis-era bond buying and start hiking interest rates. There's growing consensus that the US Federal Reserve will start taping asset purchases before year-end. When they turn off the money taps, will investors — now accustomed to access to easy money — start to panic? And what if inflation forces policymakers to move faster than expected?\nRising energy prices are feeding these fears Wednesday, sparking a sell-off in stocks and bonds. Wall Street has been enjoying the party, but it could be over soon.\nIs this Facebook's Big Tobacco moment?\nLawmakers of both US political parties have long made evident their disdain for Facebook (FB). But thanks to whistleblower Frances Haugen, the will to act could be solidifying.\nThe latest: Haugen delivered powerful testimony on Capitol Hill Tuesday that her former employer's products \"harm children, stoke division, weaken our democracy.\" She made clear to lawmakers that in her view, Facebook won't do the right thing until it's compelled to.\nFacebook whistleblower testifies company 'is operating in the shadows, hiding its research from public scrutiny'\n\"The company's leadership knows how to make Facebook and Instagram safer but won't make the necessary changes because they have put their astronomical profits before people,\" Haugen said. \"Congressional action is needed. They won't solve this crisis without your help.\"\nShe explicitly made the connection to Big Tobacco, emphasizing the need for government intervention.\n\"When we realized tobacco companies were hiding the harms [they] caused, the government took action,\" Haugen said. \"I implore you to do the same here.\"\nThe impact: Lawmakers are fired up by Haugen's testimony, as well as revelations from the documents she leaked to the Wall Street Journal. Internal research showed that Facebook was aware of problems with its apps, including the negative effects of misinformation and harm caused by Instagram to young girls.\n\"Today's testimony from [Haugen] is a catalyst for change,\" Democratic Sen. Amy Klobuchar tweeted. \"The time for action is NOW.\"\nSen. Marsha Blackburn, a Republican, slammed Facebook's approach to child safety issues and called on the company to testify directly.\nAnd yet: Facebook's stock rallied 2% on Tuesday after falling almost 5% on Monday, when the company battled an outage across its products. It's lower in premarket trading Wednesday, along with shares of other large tech companies.\nThe situation has finally gotten bad enough for CEO Mark Zuckerberg to weigh in. He released a 1,316-word statement on his personal Facebook page Tuesday night.\nZuckerberg said that instead of ignoring that young people use technology, tech companies \"should build experiences that meet their needs while also keeping them safe.\"\nWhy t-shirts and jeans could get more expensive\nThe latest commodity to see its price skyrocket? Cotton, which rallied to a 10-year high on Tuesday.\nCotton futures climbed 4% to the highest level since September 2011, my CNN Business colleague Matt Egan reports. The crop is up 22% in the past two weeks alone.\nDriving the surge: Extreme weather is a factor. Droughts and heat waves have wiped out cotton crops in the United States, the world's leading cotton exporter.\n\"It's a shortage situation. The planting season did not go that well,\" said Robert Yawger, director of energy futures at Mizuho Securities.\nYawger said traders on Wall Street have driven cotton prices even higher in recent days.\n\"All the speculators started to jump in, exacerbating a tight market,\" he added.\nWhy it matters: The cotton spike could be passed along to consumers in the form of higher prices for jeans, T-shirts and other clothing.\nPrices for apparel were already on the rise, increasing more than 4% during the 12 months to August, according to US government data. The jump in cotton futures could drive them even higher — another knock to worried investors and shoppers trying to shake off the effects of inflation.\nUp next\nCorona owner Constellation Brands (STZ) reports results before US markets open. Levi Strauss (LEVI) follows after the close.\nAlso today: The ADP report on private employment, a preview of Friday's official US jobs data, arrives at 8:15 a.m. ET.\nComing tomorrow: Earnings from Conagra (CAG).\n"}