{"title":"Dow jumps more than 300 points as stocks rebound","date":"2021-10-05","classification":"good","text":"Title: Dow jumps more than 300 points as stocks rebound\nNew York (CNN Business)Stocks staged a rebound Tuesday, rallying across the board as Wall Street bounced back from a sell-off at the start of the week.\nThe Dow (INDU) closed up 0.9% or 312 points, while the S&P 500 (SPX) finished 1.1% higher. The Nasdaq Composite (COMP) closed up 1.3%.\nIn fact, everything went up Tuesday: While stocks were rebounding, the 10-year US Treasury bond yield also rose, and was up at 1.53% around the time of the stock market close. Bond yields and prices move inversely to each other.\nElsewhere, Bitcoin crossed the $50,000 threshold for the first time in four weeks.\nOn Monday tech stocks were leading the losses, but on Tuesday they're among the biggest gainers. Inflation worries, which have weighed on the sector over the past month, couldn't hold tech stocks back Tuesday as investors took the opportunity to pick up shares at a discount.\nFacebook (FB) was back in the green as well, with its stock closing up more than 2%. The company had its worst day in nearly a year Monday, when share prices fell about 5%.The social media giant faced outages across multiple platforms Monday, and a whistleblower is testifying before lawmakers Tuesday.\nThe energy sector also got a big boost Tuesday, as rising oil and natural gas prices around the world continued to lift energy stocks.\nThat said, Tuesday's rally was broad-based with many sectors logging gains.\n\"Besides the fact that it's Tuesday and we had a big sell-off yesterday, there's really not much driving the action this morning,\" said market analysts at Bespoke Investment Group in a note.\nThis isn't the first time the market has swung wildly within days of a sell-off. That's just the state that Wall Street is in right now.\nOn the one hand, there is plenty for investors to worry about: the pace of the recovery heading into the winter, rising inflation, potentially higher taxes, Washington's debt drama, Evergrande...\nBut every time one of these concerns abates, the market is right back on track for new highs. Taking all the ups and downs of the past days into account, the S&P is actually pretty much unchanged, said Michael Reinking, senior market strategist at the New York Stock Exchange.\nEconomic data was mostly supportive of the rally on Tuesday. The Institute for Supply Management's index tracking the services industry rose faster than predicted in September.\nMeanwhile, data from IHS Markit found that while the services sector expanded last month, it was \"the slowest rise for new business for 13 months and labor shortages hampered output growth.\"\n"}