{"title":"There is no fear on Wall Street. Only greed","date":"2021-11-09","classification":"good","text":"Title: There is no fear on Wall Street. Only greed\nNew York (CNN Business)The current mood on Wall Street can only be described in one way: euphoric.\nAll the major stock market indexes are at record highs. The Nasdaq is on an eleven-day winning streak. Bond yields remain relatively low. And cryptocurrencies like bitcoin and ethereum are at all-time highs too.\nIt's no wonder then that the CNN Business Fear & Greed Index, which looks at seven gauges of market sentiment, is showing levels of Extreme Greed in the market.\nFour of the seven indicators, including stock market momentum and demand for risky junk bonds, are in Extreme Greed territory. Two other measures are in Greed territory.\nShort squeezes are pushing these stocks to the moon\nIt's a remarkable turnaround in the past few weeks. Only a month ago, the index was registering signs of Fear as stocks had just put up a dismal performance in September.\nBut is it a cause for concern? Perhaps.\nWhen investors are almost universally bullish, that often is a sign of complacency. The market may be ignoring risks and signs of froth and excess.\nDon't fight the Fed? Or earnings\nStill, some experts don't seem too concerned, mainly because corporate profit growth has been strong since the economy recovered from a brief pandemic-induced recession last year. The massive stimulus from the Federal Reserve and Congress has obviously helped too.\n\"The rally has been justified given revenue and earnings growth and volatility has been low since March 2020,\" said Brett Ewing, chief market strategist at First Franklin Financial Services.\n\"Volatility has been low since March 2020. Considering all the fiscal policies and Fed support, it makes sense that there have been no big pullbacks,\" Ewing added.\nAlthough stocks are trading at record levels, there are still opportunities in sectors like financials and energy.\nThe race to $3 trillion: Big Tech keeps getting bigger\nEarnings are growing at a healthy clip thanks to rising interest rates and surging commodity prices. Many banks and oil companies also pay handsome dividends and are rewarding shareholders with share repurchases, which boost earnings.\n\"You love opportunities where companies can return money to investors through buybacks and higher yields,\" said John Bailer, deputy head of equity income at Newton Investment Management.\nFor what it's worth, the Fed doesn't seem too worried about some of the market momentum either.\nIn a financial stability report released late Monday, the central bank noted that the big price moves in so-called meme stocks like GameStop and AMC is not a reflection of problems with the overall stock market.\n\"Recent episodes of meme stock volatility did not leave a lasting imprint on broader markets,\" the Fed said.\nOf course, skeptical investors will remember that then Fed chairman Ben Bernanke noted in 2007 that \"problems in the subprime market seems likely to be contained\" — only to have housing and mortgage issues help bring about the Great Recession in 2008.\nSo some market observers may have reason to worry that the Fed doesn't appear to be concerned about the rise of meme stocks.\n"}