{"title":"5 things to know for November 9: Capitol riot, Astroworld, climate, Covid-19, Belarus","date":"2021-11-09","classification":"good","text":"Title: 5 things to know for November 9: Capitol riot, Astroworld, climate, Covid-19, Belarus\nGet '5 Things' in your inbox\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN)Everything is coming up roses for big cryptocurrencies. Bitcoin and Ethereum both hit record highs yesterday, and some investors predict even bigger gains to come.\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here.)\n1. Capitol riot\nThe House select committee investigating the January 6 insurrection has issued six more subpoenas to top campaign associates of former President Trump, including ex-national security adviser Michael Flynn. The panel believes Flynn, along with a few other Trump campaign employees, attorneys and confidantes, were involved in promoting the lie that the presidential election was stolen. However, if the committee wants to get valuable testimony out of this new round of subpoenas, it may need to put pressure on former Trump adviser Steve Bannon, who was recently handed a contempt of Congress citation for defying his subpoena. The citation is a rare rebuke but carries few inherent consequences. Attorney General Merrick Garland is in control of a lot of this process, and there are no obvious signs he intends to act quickly. \nOverhaul of Capitol police intel unit produced confusion before riot 02:23\n2. Astroworld\nInvestigators are working to determine the causes of death of the eight people killed Friday in a crowd surge at a Houston music festival. They are reportedly looking at all possibilities, including whether a batch of counterfeit pills possibly laced with fentanyl played a role. The deadly conditions at the event have prompted a growing number of lawsuits on behalf of concertgoers. Travis Scott, the rapper behind the Astroworld Festival who was also performing at the time of the crush, announced he will pay for the funeral costs of the victims and fund mental health support for survivors. Scott, along with concert promoter Live Nation and others involved in the event, are under intense scrutiny over how the tragedy played out.\nNo room to move and no air to breathe. Concert attendee details the tragedy at Astroworld 02:50\n3. Climate\nThe COP26 climate summit in Scotland has entered its second week. By the summit's end, participants are hoping to have a \"Glasgow Agreement\" to solidify international priorities like limiting global warming to 1.5 degrees Celsius, sticking to net-zero emissions commitments and providing help to countries most vulnerable to the climate crisis. However, major fossil fuel providers like Saudi Arabia, China and Russia may resist adoption of a global warming cap. Meanwhile, former US President Obama spoke at the summit and criticized his successor, Trump, for pulling the US out of the Paris Agreement and setting off \"four years of active hostility towards climate science.\" He also took aim at the Chinese and Russian Presidents for skipping the COP26 entirely.\nObama on climate change: We can't afford anyone on the sidelines 02:18\n4. Coronavirus\nGlobal Covid-19 cases have now surpassed 250 million, just a year and eight months after the World Health Organization put a name to the coronavirus pandemic. Together, the US, India and Brazil account for 40% of reported cases. Globally, about 4 billion people have gotten at least one dose of a Covid-19 vaccine, and about 3.1 billion people are fully vaccinated. In the US, Pfizer is expected to seek FDA authorization as soon as this week for a booster shot for people 18 and older. Boosters at a certain point after initial inoculation are already FDA-authorized for several groups, including those 65 and older, immunocompromised people and those with certain living or working conditions.  \nNBA icon: Aaron Rodgers' vaccine lies destroy confidence 01:30\n5. Poland-Belarus\nTensions are escalating between Poland and Belarus as a weekslong migrant crisis there comes to a head. Polish officials have repeatedly accused the country's eastern neighbor of moving migrants toward the Polish border. More and more people have been illegally crossing Poland's border from Belarus in recent weeks -- more than 30,000 since August, according to the Polish Border Guard. Additional military personnel have been deployed to deal with the situation, and another neighbor -- Lithuania -- has also sent troops to the border. European officials have accused Belarusian leader Alexander Lukashenko of encouraging people to cross illegally into Poland and other European neighbors in retaliation for recent sanctions by the EU, the US and Britain over Lukashenko's crackdown on political opposition. \nVideo from Poland-Belarus border shows thousands caught in standoff 02:33\nBREAKFAST BROWSE\nA 9-foot video game joystick now holds a Guinness World Record\nPlaying a game with that is a whole workout! \nAdele debuts new song 'Hold On' in Amazon holiday ad\nYou can't just spring Adele on us; we need to be emotionally prepared! \nInternet goes wild for Adele's blooper reel 01:38\n'Yellowstone' season premiere teases prequel series starring Tim McGraw\nLet's keep the \"run away from your current life and become a rancher\" fantasy going.\nHeinz produces ketchup in 'Mars-like' conditions\nMmm, tastes like science.\nNew Zealand cricket match suspended as pitch invaded by bees\nWhat does one do in such a situation? Apparently, lie flat on your stomach and pray the bees don't get you.\nTODAY'S NUMBER\n24\nThat's how many states just this year have been sites of legislative attempts to restrict how topics like racism, sexism and American history are taught in schools, according to an analysis by the free expression group PEN America.\nCritical race theory debate heats up in schools across US 04:07\nTODAY'S QUOTE\n\"Is my life more important than doing something really good in my career?\"\nJosh Cavallo, the only current openly gay player in men's top-flight soccer. Cavallo says he would be \"scared\" to play at the 2022 FIFA World Cup in Qatar because of the country's homosexuality laws.\n'I'm a footballer and I'm gay:' Hear pro player reveal he's gay 01:27\nTODAY'S WEATHER\nPacific Coast rain and snow push towards the Rockies 01:48\nCheck your local forecast here>>>\nAND FINALLY\nCool it down\nHow do you get ice really, really clear and really, really smooth? It's a surprisingly satisfying process. (Click here to view.)\n"}