{"title":"Move over, bitcoin. Ether is back and nipping at your heels","date":"2021-11-10","classification":"good","text":"Title: Move over, bitcoin. Ether is back and nipping at your heels\nNew York (CNN Busines)Bitcoin has rocketed to an all-time high of nearly $70,000. But investors are even more excited about ethereum, which is now the world's second most valuable cryptocurency.\nEthereum, or ether for short, is also trading at record levels. It's now hovering around $4,850, having soared more than 560% this year, compared to the \"mere\" 135% pop for bitcoin. Crypto investors are betting that ether will continue to be used as the backbone for even more non-fungible tokens, or NFTs, as well as so-called smart contracts.\nExperts predict that this wave of decentralized finance (DeFi) will become more prevalent in banking. That could be great news for ether, as well as solana, another crypto that has blockchain technology used in DeFi applications.\nApple has no immediate plans to accept crypto as payment, Tim Cook says\nEther, which now has a total value of about $575 billion for all its coins in circulations, has also narrowed the market cap gap with bitcoin, which is worth about $1.3 trillion. The two cryptos now make up almost two-thirds of the nearly $3 trillion cryptocurrency market.\n\"We're seeing a shift in the industry where bitcoin went from being 75 percent of the overall cryptocurrency market cap to about 50 percent,\" Michael Pinsker, founder and president of wealth management tech firm Docupace, said about the drop in bitcoin's market share since 2017. \"That percentage should come down even further.\"\nMore investors flocking to ether\nEther has also become more popular with many traders on crypto brokerage Coinbase.\nIn its latest earnings report after the closing bell Tuesday, Coinbase said that 22% of its third quarter trading volume was for ether, compared to 19% for bitcoin. That's the second straight quarter that ether trading was higher than bitcoin.\nThere could even be a so-called \"flippening\" in the next decade, where the value of ethereum winds up topping bitcoin, said Jared Madfes, a partner with Tribe Capital.\nThe persistence of inflation is benefiting ether and other cryptocurrencies, too. Consumer prices continue to surge and investors recognize that digital currencies are gaining value at a time when interest rates remain low and the Fed and other central banks pump money into the economy.\nEthereum's 27-year-old founder says we're in a crypto bubble. Did it just burst? 03:01\n\"Inflation is not going away. Central banks printing money is a chasm that can't be crossed,\" said Dylan LeClair, head of market research at Bitcoin Magazine.\nThe rise of bitcoin ETFs also could be good news for ethereum, because experts predict that similar ether ETFs could soon launch. That will make it even easier for average investors and big money management firms to buy into the crypto.\n\"Institutions want more exposure to cryptocurrencies, so I anticipate there will be ether ETFs,\" Tribe Capital's Madfes said.\nExperts say stick to ether and bitcoin and avoid meme coins\nStill, investors need to be careful when buying cryptocurrencies. Not all of them have practical uses.\nThere are now many so-called meme coins out there, such as dogecoin and shiba inu, that have popped in price thanks to social media hype (including from Tesla (TSLA) CEO Elon Musk) and other more silly reasons.\nBitcoin for beginners: Here's what to know before you invest in crypto\n\"Crypto now is a lot like the 1990s and the internet,\" said Eric Satz, CEO and founder of Alto, an investment firm which offers a crypto IRA. He's referring to the many e-commerce companies that went public and soared back then. But only one true leader, Amazon (AMZN), is still standing today.\n\"There are a whole lot of crypto assets out there. But there will be a lot of roadkill. Investors need to proceed with caution,\" Satz said, adding that its investors have a crypto portfolio that's made up mostly of bitcoin, ether and solana.\nRay Youssef, co-founder and CEO of Paxful, a crypto trading platform, has an even more cautious take. Crypto investors should not hold dogecoin, shiba inu or any of the other more speculative cryptos, he said, because big corrections lie ahead.\nIt's like the stock market in that respect: It's one thing to own shares of Apple (AAPL), Microsoft (MSFT) or another top company in the S&P 500. Meme stocks are another story.\n\"Ether and bitcoin versus meme coins are like the difference between blue chips and penny stocks you get a call about from a guy in a boiler room,\" Youssef said.\n"}