{"title":"Dow logs worst day in over a year as fears over new Covid-19 variant grip global markets","date":"2021-11-26","classification":"bad","text":"Title: Dow logs worst day in over a year as fears over new Covid-19 variant grip global markets\nNew York (CNN Business)Wall Street was in a frenzy on Black Friday as stocks around the world tumbled in the face of a new Covid-19 variant.\nUS equities took a dive at the open and continued their downward path, resulting in a terrible day for the stock market and the worst day for the Dow in over a year. Oil prices were also badly hit.\nThe new variant has been detected in South Africa, Botswana, Hong Kong and Israel, prompting some countries to put flight bans in place.\nOver the summer, the Delta variant spooked consumers and weighed on sectors like leisure and hospitality. Now investors and economists worry this new variant could do the same.\nThe Dow (INDU) logged its worst performance since October 2020, falling 905 points, or 2.5%. The S&P 500 (SPX) had its worst day since February, closing down 2.3%. For the Nasdaq Composite (COMP) it was the worst day since September. The index finished down 2.2%.\nIt was a shortened trading session that ended at 1pm ET after the markets were closed Thursday for Thanksgiving. Traditionally, this half-day session is lower in trading volume, which can exacerbate the swings in the market.\n\"The pandemic and COVID variants remain one of the biggest risks to markets, and are likely to continue to inject volatility over the next year\" or even beyond, said Keith Lerner, co-chief investment officer and chief market strategist at Truist Advisory Services, in a note to clients.\n\"It's hard to say at this point how lasting or impactful this latest variant will be for markets,\" he added.\nIt might take days or weeks to assess the severity of the new variant, so Friday's sell-off might not be an immediate opportunity to pick stocks up on the cheap, said Sam Stovall, chief investment strategist at CFRA Research.\nBut not all stocks took a beating. Within the S&P 500, healthcare stocks climbed, led by Covid vaccine manufacturers Moderna (MRNA) and Pfizer (PFE). Moderna shares closed up more than 20%, while Pfizer stock rose more than 6%.\nOutside of equities, other asset classes also struggled Friday.\nOil prices tumbled, for example. US oil futures fell more than 12%, or almost $10, to $68.82 per barrel around the time of the stock market close. The global benchmark Brent dropped more than 10% to $73.66 per barrel.\nThe US dollar, measured by the ICE US Dollar Index, which pegs it against its main rivals, was down 0.6% when stocks closed.\nCryptocurrencies also felt the heat, dropping across the board. Bitcoin was down more than 8% in the early afternoon, according to CoinDesk data.\nMeanwhile, investors are pushing into safe haven investments. The 10-year US Treasury bond got more expensive and yields fell by more than 0.1 percentage points to 1.51% around the stock market close. Gold prices also jumped.\n"}