{"title":"Amazon posted a crypto job. Bitcoin surged 14%","date":"2021-07-26","classification":"good","text":"Title: Amazon posted a crypto job. Bitcoin surged 14%\nNew York (CNN Business)Amazon listed a job opening for a digital currency and blockchain product lead, sending cryptocurrencies soaring Monday.\nBitcoin (XBT) climbed to a six-week high of nearly $39,043, while ethereum reached $2,363. Dogecoin was last trading at about 22 cents per coin, giving it a $28.8 billion market cap. As of Monday afternoon, both bitcoin and dogecoin had soared more than 14% over the past 24 hours, according to Coinbase. And ethereum went up nearly 12% over that period.\nTypically, when Amazon is rumored to enter a new market, stocks of soon-to-be rivals tumble. But Amazon's job listing had the opposite effect Monday, generating buzz about the tech company's future involvement with cryptocurrencies and its potential to further legitimize the nascent digital currency sector.\nCryptocurrency, explained\nIn Amazon's (AMZN) listing, which was posted Thursday, the company says it is looking for someone with a \"deep understanding\" of the \"cryptocurrency ecosystem and related technologies.\"\nThe role would be part of Amazon's payment acceptance and experience team, according to the job description, perhaps implying that the e-commerce giant could accept cryptocurrencies as payment in the near future.\n\"We're inspired by the innovation happening in the cryptocurrency space and are exploring what this could look like on Amazon,\" a spokesperson for the company told CNN Business. \"We believe the future will be built on new technologies that enable modern, fast and inexpensive payments, and hope to bring that future to Amazon customers as soon as possible.\"\nCryptocurrencies are having a roller coaster year, and they rallied Monday, just a few days after Amazon posted the job opening.\nThe conversation surrounding cryptocurrencies has become more prominent in corporate America this year. Although Tesla founder and CEO Elon Musk's tweets have incited whiplash in the crypto space, the company's initial $1.5 billion investment in bitcoin helped legitimize cryptocurrencies as an investment. Musk recently said he's invested in bitcoin and wants to \"see it succeed.\" And during earnings conference calls this year, Wall Street analysts have peppered executives at high-profile companies about possibly entering the bitcoin space.\nAmazon's stock was up a little more than 1% Monday.\nCorrection: A previous version of this story incorrectly stated the day that Amazon's job listing was posted.\n"}