{"title":"A group of crypto investors tried to buy a copy of the Constitution. It didn't work out","date":"2021-11-18","classification":"good","text":"Title: A group of crypto investors tried to buy a copy of the Constitution. It didn't work out\nNew York (CNN Business)A group of cryptocurrency investors took the notion \"We the people\" from the US Constitution to the next level. They pooled money to try to buy a rare copy of the document — and they claimed to have raised $40 million to do so.\nBut despite the huge amount of money raised, the group failed to buy the document.\nAuction house Sotheby's sold an early copy of the Constitution Thursday for $41 million. With fees and buyer's premium included, the final price was $43.2 million.\nA group known as Constitution DAO said they wanted to buy it and had planned to partner with another entity to display it.\nBut on Thursday night, the group tweeted a statement indicating they didn't win the auction.\n\"While this wasn't the outcome we hoped for, we still made history tonight with ConstitutionDAO. This is the largest crowdfund for a physical object that we are aware of — crypto or fiat. We are so incredibly grateful to have done this together with you all and are still in shock that we even got this far.\"\nThe group said those who contributed funds \"will be able to get a refund of your pro rata amount (effectively minus gas fees) through Juicebox.\"\nIn case you're wondering what DAO means, it stands for \"decentralized autonomous organization.\" DAOs are set up using the blockchain, the backbone of bitcoin and other cryptocurrency transactions.\nRare first-edition copy of US Constitution could fetch $20 million\nInvestors who contributed to the Constitution DAO pool have largely been using ethereum, the world's second most valuable cryptocurrency, to pay for their chunk of the offer.\nSupporters of Constitution DAO have been touting the bid on Twitter, with one super enthusiastic and patriotic poster writing a nine-tweet thread that featured the Constitution's entire preamble in capital letters.\nBefore the auction, the Sotheby's web site listed an estimated sale price of $15 million to $20 million for the document, which is thought to be one of just thirteen copies remaining from an original printing of 500.\nCryptocurrencies are becoming increasingly popular methods of payment in the art world.\nSotheby's, in particular, has embraced bitcoin and ethereum, or ether for short, as a way for collectors to bid on pieces of art and other items.\nEarlier this year, Sotheby's said it would accept bitcoin or ether as payment for a work by the popular street artist Banksy.\nAnd just last week Sotheby's announced just last week that it planned to have its auctioneer disclose real-time bid amounts in increments of ether for two other Banksy works going up for sale.\n"}