{"title":"Better.com's CEO just burnished his reputation as a bully","date":"2021-12-07","classification":"bad","text":"Title: Better.com's CEO just burnished his reputation as a bully\nNew York (CNN Business)Editor's Note: A version of this story appeared in CNN Business' Nightcap newsletter. To get it in your inbox, sign up for free, here.\nThe CEO of Better.com fired more than 900 employees at once in a Zoom meeting last week, reportedly accusing them of \"stealing\" from their colleagues and customers by being unproductive and only working two hours a day.\nJust in time for the holidays...\n\"If you're on this call, you are part of the unlucky group that is being laid off,\" the CEO, Vishal Garg, told the staff. The 900 layoffs, which included the firm's diversity, equity and inclusion recruiting team, amount to about 9% of the workforce. He told the employees they could expect an email from HR detailing benefits and severance.\nA BIT OF BACKGROUND\nThis mass layoff may seem shockingly harsh and detached, but it also tracks with the reputation Garg has made for himself as an erratic tech CEO.\nGarg founded Better.com in 2016 with the mission of simplifying the mortgage-buying process.\nSoftBank, the Japanese conglomerate, invested more than $500 million in the company earlier this year.\nBetter is now in the process of going public via a special purpose acquisition company, or SPAC, in a deal that would value the company at about $7 billion.\nThe firm hired some 7,000 people during the pandemic-fueled real estate boom, according to Insider.\nHe once berated staff in an email obtained by Forbes, writing: \"You are TOO DAMN SLOW. You are a bunch of DUMB DOLPHINS... YOU ARE EMBARRASSING ME.\"\nHe also reportedly told a former business partner (who was the best man at his wedding) that he was \"burn him alive,\" according to the Daily Beast, which chronicled a litany of allegations against Garg and the company.\nSoon after the mass layoff last week, Garg held a separate phone call with the remaining staff in which he blamed himself for managerial problems. \"Today, we acknowledge that we overhired and hired the wrong people, and in doing that, we failed,\" Garg said, according to Insider. \"I failed. I was not disciplined over the last 18 months.\"\nThe company's CFO described the layoffs as \"gut-wrenching\" but necessary, using the exactly the kind of tech-startup-speak you might expect: \"A fortress balance sheet and a reduced and focused workforce together set us up to play offense going into a radically evolving homeownership market.\"\nMY TWO CENTS\nLook, there's no great way to lay people off, but there's a way to do it while being a human, and this wasn't it.\nFirst, there's the timing. Ebenezer Scrooge himself wouldn't fire people three weeks before Christmas. And then the whole thing was handled over Zoom. Maybe that was unavoidable, but the process was made even less personal by having everyone crammed into one virtual room for a single, brief meeting.\nSometimes bad press is just bad press. And by carrying out one of the laziest, worst-timed layoffs ever, Better.com's executives have everyone talking about their company for all the wrong reasons.\nRELATED: 5 mistakes to avoid if you have to lay off employees remotely.\nNUMBER OF THE DAY\n20%\nLast week, as markets swung on conflicting information about the Omicron variant, bitcoin prices stayed surprisingly stable. Then the weekend happened... On Saturday, bitcoin plunged more than 20% — even for the notoriously volatile crytpo, that's pretty wild. It's now holding steady at roughly $49,000, down from about $57,000 at the beginning of December.\nMeanwhile, the Dow surged more than 600 points Monday, recouping nearly all of its losses from last week's selloff.\nWHAT ELSE IS GOING ON?\nNew York City will mandate Covid vaccines for all private sector workers.\nCNN fired Chris Cuomo on Saturday amid an investigation into his role in helping his brother, former Governor Andrew Cuomo, rebut sexual harassment accusations.\nFederal regulators are investigating a deal to bring former President Trump's new media venture public via a SPAC.\nShares of electric vehicle maker Lucid Motors plunged Monday after the company disclosed it had received a subpoena from the SEC.\nHong Kong's government warned the Wall Street Journal that the paper may have broken electoral law by \"scaremongering\" in a recent editorial about the vote for the city's legislative council.\nEnjoying Nightcap? Sign up and you'll get all of this, plus some other funny stuff we liked on the internet, in your inbox every night. (OK, most nights — we believe in a four-day week around here.)\n"}