{"title":"How eBay's new CEO turned it into a pandemic winner","date":"2021-12-04","classification":"bad","text":"Title: How eBay's new CEO turned it into a pandemic winner\nNew York (CNN Business)When PayPal split off from eBay a few years ago, eBay was considered to be the less exciting company. But that's certainly not the case on Wall Street this year.\nShares of eBay (EBAY) have surged more than 30% this year, while PayPal (PYPL) has stumbled more than 20%.\nThe companies have had a wildly different 2021. PayPal, which now lets people buy and sell bitcoin, has been subject to the volatility in the cryptocurrency market and concerns about its rumored plan to offer to buy Pinterest (PINS), though PayPal later said no deal was happening.\nEbay, by contrast, has made a big comeback during the pandemic thanks to bets on several rapidly growing parts of the digital commerce market — namely sneakers, sports memorabilia and car parts.\nCNN Business spoke to eBay CEO Jamie Iannone, who rejoined eBay in April 2020, about the firm's transformation into an enthusiast-focused retailer.\n\"This is part of a multi-year reimagining of eBay. These categories we're focusing on are huge,\" said Iannone, who was an executive at Barnes & Noble and Walmart (WMT) before returning to eBay, where he worked for most of the 2000s.\nFocusing more on the repeat power buyers\nIannone has helped push eBay into markets where buyers are willing to spend lots of money numerous times a year. Wall Street likes that.\nShares of eBay are up more than 70% since Iannone came back to the company. That's better than the gains for PayPal and the broader market during the same time frame. The pivot to collectibles that have passionate, younger buyers has been a big win for the company.\nEBay looks to cash in on trading cards boom\nIannone said eBay realizes there is a big difference between its casual shoppers and its so-called power buyers who make purchases of nearly $1,000 multiple times a year.\nThat audience is where eBay is now putting much of its attention, Iannone said, because it makes more sense to cater to the loyalists instead of spending a lot more money on marketing and advertising just to increase the general user base.\n\"Some of the [power buyers] wake up, get a cup of coffee and turn to eBay,\" Iannone said. \"We were too focused on acquiring buyers and getting them at any costs. We're leaning in now on the enthusiasts.\"\nAs a result of this new focus, Iannone said eBay made more money selling trading cards in the second quarter of this year than it did in that category in all of 2020, for example.\nThe 'accidental entrepreneurs' give eBay a boost\nIannone said he loves meeting with people who have set up stores on eBay and now make their living from it. That includes someone who was laid off by the Orlando Magic basketball team during the 2020 shutdown of the NBA season and now sells sneakers full-time on eBay. It's been a common story during the pandemic, he said, as many people left the traditional workforce.\n\"These are the accidental entrepreneurs,\" Iannone said, adding that while most people on the platform say they start selling on eBay to boost their income, nearly 15% are doing so because they have lost a job.\nThe company is also leveraging the power of social media and the influencer community -— including a sneaker marketing campaign on TikTok.\nNYSE owner says it is not buying eBay\nThe company has increased efforts to authenticate the value of items like shoes, baseball cards and musical instruments. For example, eBay just acquired sneaker authentication service Sneaker Con. It's also tracking the value of trading cards in real time like stocks. (And Iannone himself recently bought a \"barely used\" oboe for his daughter on eBay.)\n\"Ebay has been a pioneer of collectibles exchanges and re-commerce,\" Iannone said. \"We're leaning into that. It's all about regaining trust on the platform.\"\nMotor vehicle accessories are the next big area of focus for eBay, he said, adding that when he needed a part for a windshield, he found a perfect fit on eBay for $9 that probably would have cost $40 at the auto dealership.\nBuy now and pay later — but not with bitcoin\nThe company is also embracing more modern forms of payment to continue attracting younger millennial and Gen Z customers.\nEBay now accepts Apple Pay and Google Pay, and it's experimenting with the \"buy now, pay later\" (BNPL) trend in the form of a partnership in Australia with Afterpay (which Square (SQ) is in the process of buying for nearly $30 billion).\n\"This does help attract newer customers to the platform. People like to use it for high-priced items,\" Iannone said. \"BNPL is bringing in a younger demographic.\"\nBut one trend eBay isn't embracing just yet is bitcoin. Given the volatility in cryptocurrencies, Iannone said the company will not be accepting any of them as payment \"for the foreseeable future.\"\n"}