{"title":"Turnaround Tuesday on Wall Street: Stocks rebound","date":"2021-12-21","classification":"good","text":"Title: Turnaround Tuesday on Wall Street: Stocks rebound\nNew York (CNN Business)The Dow and the broader US stock market were in the green on Tuesday, as the market bounced back from a sharp selloff at the start of the week.\nOnce again the steep losses of more than 1% for each of the major indexes are being quickly followed by green arrows across the board.\nThe Dow (INDU) finished up 1.6% or 561 points, while the S&P 500 (SPX) rose 1.8%. The Nasdaq Composite (COMP) closed 2.4% higher.\nAll three benchmarks snapped a three-day losing streak and notched their best performance in about two weeks.\nBut things aren't too dire in the market: the indexes are all on track for decent gains this year. Both the Dow and the S&P will outpace last year's performances.\nBut that said, the catalysts driving stocks lower on Monday are still present:\nThe losses came on the heels of soaring Covid cases as the Omicron variant is slamming Europe and the United States, where governments have responded by tightening restrictions.\nOn Tuesday, the US Centers for Disease Control and Prevention suggested that Omicron cases will likely cause higher infection rates than we've seen with previous peaks.\nPresident Joe Biden Tuesday afternoon said vaccinated Americans can still celebrate the holidays together, especially if they've received a booster shot. The administration has also been adamant that federal lockdown recommendations aren't in the cards this time.\nAlthough this may bring back memories of the Delta case surge of the summer, some analysts are betting that the Omicron spread might be less severe.\n\"This strain of Covid appears to be much weaker in severity than the Delta strain, even if it is more transmissible,\" said analysts at Bespoke Investments. And that would mean less economic disruption.\nOn top of that, there's drama in Washington after Democrat Sen. Joe Manchin said he would oppose President Joe Biden's $1.75 trillion \"Build Back Better\" bill.\nThinner trading volume in the final weeks of the year can also mean that market moves are exacerbated. So more volatility could lie ahead.\nThat said, the CBOE volatility index (VIX), or VIX for short, was down nearly 8%.\n\"Investors may be getting into a speculative mood,\" said JJ Kinahan, chief market strategist at TD Ameritrade.\n\"Additionally, cryptocurrencies which have recently been correlated with 'risk on' investments are seeing rallies as well.\"\nBitcoin was up more than 3% around the time of the stock market close, according to Coinbase.\n"}