{"title":"5 things to know for December 13: Tornadoes, Capitol riot, Covid-19, SCOTUS, Russia","date":"2021-12-13","classification":"good","text":"Title: 5 things to know for December 13: Tornadoes, Capitol riot, Covid-19, SCOTUS, Russia\nGet '5 Things' in your inbox\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN)Shirley Raines, who brings beauty and hope to the men and women living on Los Angeles' Skid Row, is the 2021 CNN Hero of the Year. For the past six years, she's provided food, clothing and hair and makeup services to thousands. \nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here.)\n1. Tornadoes\nMore than 100 people are feared dead after a series of tornadoes ripped through several states in the Midwest and South and transformed homes and businesses into piles of rubble late Friday into Saturday. In Kentucky alone, the death toll is at least 80 and will exceed 100, Gov. Andy Beshear told CNN yesterday, making it the deadliest tornado event in the state's history. Destruction was also reported in Illinois, Arkansas, Missouri and Tennessee. At least six people died at a collapsed Amazon warehouse in the Illinois city of Edwardsville. Powerful storms like the ones responsible for the weekend's widespread damage are the \"new normal\" in an era of climate change, said FEMA chief Deanne Criswell. As people rebuild, here's how you can help. \nGov. Beshear describes devastation: Towns are gone 02:53\n2. Capitol riot\nFormer White House chief of staff Mark Meadows sent an email saying the National Guard would be present to \"protect pro Trump people\" in the lead-up to the US Capitol insurrection, according to a contempt report released late yesterday by the January 6 committee. The report includes several new details about Meadows' actions before and on January 6, as well as his role in attempting to overturn the 2020 election. The panel informed Meadows last week it had \"no choice\" but to advance criminal contempt proceedings against him following his decision to stop cooperating with the committee.\nJanuary 6 committee zeroes in on key question about Trump and his aides 01:34\n3. Coronavirus\nA new mandate that requires people in New York state to wear a mask in all indoor public spaces unless businesses implement a vaccine requirement goes into effect today. The new rule was announced late last week by Gov. Kathy Hochul, who said she is trying to get ahead of what she calls a \"winter surge\" for three main reasons: increased cases, reduced hospital capacity and insufficient vaccination rates in certain areas. The mandate will be in effect until January 15. In South Africa, President Cyril Ramaphosa is getting treatment for mild Covid-19 symptoms after testing positive. Ramaphosa, who is fully vaccinated, recently returned from a trip in West Africa. South Africa is where scientists identified the new Omicron variant.\nCovid cases rise in the US as Omicron now in over half of all states 01:26\n4. SCOTUS\nCalifornia Gov. Gavin Newsom has expressed \"outrage\" at the Supreme Court's decision Friday to allow Texas' six-week abortion ban to stay in effect and said he would use similar legal tactics to tackle gun control in his state. The Supreme Court ruling allowed Texas' abortion law, which bars the procedure after the first six weeks of pregnancy, to remain in place but said abortion providers have the right to challenge the law in federal court. However, the ruling limits which state officials can be sued by the abortion providers, which could make it difficult for them to resume providing abortions after the sixth week of pregnancy. In light of the decision, Newsom said he directed his staff to draft a bill that would allow private citizens to seek injunctive relief \"against anyone who manufactures, distributes, or sells an assault weapon or ghost gun kit or parts in the State of California.\"\nSupreme Court upholds Texas abortion law but says providers can sue 02:28\n5. Russia\nRussian President Vladimir Putin told President Joe Biden he would \"really like\" to meet for more talks, according to a video clip released yesterday by Russian state TV. In the short clip from the leaders' virtual call last week, Putin told Biden, \"We will definitely meet, I would really like that.\" The top US State Department official for Europe will travel to Russia and Ukraine this week to discuss Russia's military buildup near the border of Ukraine, less than a week after Biden told Putin in a call that the US is prepared to impose strong economic measures should Russia invade Ukraine, the State Department announced over the weekend.\nBiden confronts Putin as tensions escalate over Ukraine 04:28\nBREAKFAST BROWSE\nThe Heisman Trophy for 2021 season goes to Bryce Young\nHe's the first University of Alabama quarterback to win the award.\n'West Side Story' has a disappointing box office opening\nMaybe Steven Spielberg should have added a few dinosaurs, or a really big shark!\nSteven Spielberg's 'West Side Story' mixes old, new 01:16\nMegan Thee Stallion celebrates her college graduation\nThe Grammy-winning rapper earned a bachelor of science degree in health administration.\nPeloton has a response for the 'Sex and the City' reboot shocker\nAnd just like that ... he's alive.\nPeloton slashes forecast as demand slows 01:51\nItalian bishop apologizes for telling children Santa doesn't exist\nLooks like someone's getting coal in his stocking. \nHAPPENING LATER\nMichigan school shooting suspect Ethan Crumbley is due in court today. He faces murder, assault and weapons charges in the rampage that killed four students. He also faces one count of terrorism causing death, a rare charge for a school shooting. The 15-year-old, who's pleaded not guilty to all charges, will be tried as an adult.\n'Unforgivable': Sandy Hook mom reacts to parents of Michigan school shooter 02:19\nTHIS JUST IN\nIsraeli Prime Minister Naftali Bennett met with Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed at his private palace in Abu Dhabi, according to Bennett's office. It marks the first official visit of an Israeli Prime Minister to the United Arab Emirates and comes 15 months after the signing of a normalization agreement between the two countries.\nTODAY'S NUMBER\n73.4 million\nThat's how many followers Indian Prime Minister Narendra Modi has on Twitter. Modi's Twitter handle was \"very briefly compromised,\" his office said yesterday, when a tweet was sent from his personal account saying India had adopted Bitcoin and would be distributing the cryptocurrency to all its residents. India does not recognize Bitcoin as legal tender.\nEric Adams explains why he wants his paycheck in Bitcoin 02:06\nTODAY'S QUOTE\n\"I'm ready for a new adventure, and I hope you'll check it out.\"\nFox News anchor Chris Wallace, announcing his surprise departure from the network yesterday at the end of \"Fox News Sunday.\" Shortly after, CNN announced that Wallace will join CNN+, a streaming product launching early next year, to host a show featuring interviews with newsmakers \"across politics, business, sports and culture.\"\nChris Wallace joins an exodus of journalists from Fox News 04:47\nTODAY'S WEATHER\nStrong storm slamming into the Western US 02:11\nCheck your local forecast here>>>\nAND FINALLY\nNoodling around\nThis chef can make 128 noodles in 10 seconds! (Click here to view.)\n"}