{"title":"Narendra Modi's Twitter account hacked with announcement India would adopt Bitcoin","date":"2021-12-12","classification":"bad","text":"Title: Narendra Modi's Twitter account hacked with announcement India would adopt Bitcoin\n(CNN Business)Narendra Modi's Twitter handle was \"very briefly compromised,\" his office said, when a tweet was sent from the Indian Prime Minister's account saying his country had adopted Bitcoin and would be distributing the cryptocurrency.\n\"The matter was escalated to Twitter and the account has been immediately secured,\" the Indian PM's office said in a tweet on Sunday.\n\"In the brief period that the account was compromised, any Tweet shared must be ignored,\" officials added.\nSeveral Twitter users shared screenshots of the tweet put out from the Indian Prime Minister's personal twitter account, @narendramodi, when it was compromised, according to CNN's affiliate News-18.\nThe screenshot read: \"India has officially accepted bitcoin as legal tender. The government has officially bought 500 BTC\" and would be \"distributing them to all residents of the country.\"\nThat tweet has since been deleted. Along with the tweet, a possible scam link was also attached.\nBitcoin's self-proclaimed inventor largely prevails in trial over stash worth $54 billion\nModi has more than 70 million followers on Twitter — among the most of any world leader.\nIndia does not recognize Bitcoin as legal tender.\nIn September, El Salvador became the first country in the world to adopt the cryptocurrency as legal tender and last month, the country's president Nayib Bukele said he planned to build the world's first \"Bitcoin City\" — funded initially by Bitcoin-backed bonds.\nIndia has even recently entertained the idea of a ban on crypto. Last month, Modi's government said that it was preparing to introduce a bill that would \"prohibit all private cryptocurrencies in India.\" But the description of the bill also says it would allow for \"certain exceptions to promote the underlying technology of cryptocurrency and its uses.\"\nThat language leaves a lot of room for interpretation. The bill didn't specify what is meant by \"private\" cryptocurrencies, so it's not clear whether that applies to the world's most heavily traded coins, including bitcoin and ethereum. India's finance ministry did not respond to questions from CNN Business about the bill last month. It has yet to be presented in the current parliamentary session.\n— Diksha Madhok contributed to this report.\n"}